[
    {
        "title": "Prime Day Isn’t Over Yet; Amazon Reveals 10 Amazing Deals This Saturday Morning - Gizmodo",
        "description": "Amazon has chosen to extend the majority of Prime Day offers through this weekend. Almost all the deals remain available, except for those that are out of stock.",
        "url": "https://gizmodo.com/prime-day-isnt-over-yet-amazon-reveals-10-amazing-deals-this-saturday-morning-2000511424",
        "publishedAt": "2024-10-12T09:38:46Z",
        "content": " As we enter this Sunday following Prime Day, Amazon has surprised everyone by extending the major part of its deals into the weekend. This unexpected extension allows both Prime and non-Prime members to take advantage of a wide array of discounts which makes it an ideal time to purchase items you may have missed during the official event. See all deals at Amazon The extended Prime Day sale continues to feature massive price cuts on very popular items, be it on Amazon or on some competitors sites. Apple products remain a hot commodity with the AirPods Pro 2 still available at $189 down from $249. The 9th generation iPad maintains its 40% discount and deals on AirTags ($79 for a 4-pack) and AirPods Max ($399) persist. MacBook are also on sale. Amazon is own devices have not been left out with Echo speakers and Ring security cameras seeing massive reductions of 40% to 70%. One of the most popular deals of this Prime Day week is the Google Nest Wifi router which Amazon is clearing out at a mere $38 down from $169 (Google has discontinued the production and Amazon is doing a stock clearance). As part of the exciting post-Prime Day deals, LEGO enthusiasts will find some fantastic offers that are hard to resist. Notably, the LEGO Star Wars Advent Calendar is available at a 20% discount which makes it a perfect gift for fans looking to count down to the holidays with a daily surprise. It is currently the most popular product among the Toys category and it has been bought over 60k times in the past month on Amazon. Although many deals are now accessible to all, Prime members continue to enjoy additional perks such as free and fast shipping, access to Prime Video, Amazon Music and exclusive deals throughout the year (including Prime Day of course). The Prime membership costs $139 per year or $14.99 per month and includes a plethora of benefits that enhance your shopping experience. Beyond entertainment, Prime members can dive into Prime Reading for access to over a thousand e-books and magazines at no extra cost. The membership also includes Amazon Music with ad-free listening to over 100 million songs and podcasts. For gamers, there are exclusive benefits through Prime Gaming, including free monthly games and in-game content."
    },
    {
        "title": "Amazon is stuffing generative AI into its shopping experience",
        "description": "Amazon has introduced a batch of new generative AI tools that aim to improve the retail experience for both customers and sellers on the platform.",
        "url": "https://www.theverge.com/2024/9/19/24249046/amazon-generative-ai-tools-personalized-shopping-recommendations",
        "publishedAt": "2024-09-19T16:29:27Z",
        "content": " Amazon has introduced a batch of new generative AI tools that aim to improve the retail experience for both customers and sellers on the platform. One of the more notable features announced at the Amazon Accelerate event on Thursday will use customers' preferences, search, browsing, and purchase history to create personalized product recommendations on Amazon is homepage.\n\nInstead of the more like this feature that suggests similar, specific items, the new recommendations will be offered as larger categories based on a customer is shopping habits — such as those catering to holiday events or sporting activities. The company says it is leveraging a large language model to recommend products with specific features, but it is not clear how different this will be from the current user experience.\n\nThe feature will also curate more relevant product descriptions around user interests. Terms like gluten-free will appear more prominently in the descriptions of relevant products for customers who regularly search for gluten-free items, for example.\n\n[Image: If your search history reveals you shop for furniture that sits two people, Amazon will make that feature clearer on relevant item listings. \n\nSome new tools being released for third-party sellers on the platform include a free video generator tool that references a product is image and features to produce AI-generated clips. The company says this feature was developed to make video marketing more accessible and cost-effective, citing a study from animated video firm Wyzowl that found 89 percent of consumers want to see more videos from brands.\n\n[Media: \n\nA new live image feature is also being added to the image generator that Amazon introduced last year, allowing users to partially animate still images — such as adding steam to mugs or a breeze that makes plants sway. Amazon says that both the live image and new video generator are available now in beta to select US advertisers, where they will be fine-tuned before wider release.\n\nAlso launching in beta is Project Amelia, a chatbot that provides personalized recommendations, insights, and troubleshooting assistance, geared at improving business performance for third-party Amazon retailers. For example, when sellers ask Project Amelia how their business is doing, the chatbot will respond with a summary of sales data, website traffic, and year-over-year performance comparisons. Amazon says the beta, which is currently limited to a small group of US retailers, will expand to additional US sellers in the coming weeks and roll out to additional countries later this year.\n\n[Media: \n\nThis is a sizable batch of generative AI updates for Amazon, which has otherwise been lagging behind larger players in the industry like Meta and Google. According to Reuters, Amazon will be using Anthropic is Claude AI to power upcoming Alexa improvements after finding its own AWS models struggled with words and responding to user prompts.\n"
    },
    {
        "title": "Reduce Energy and Money with Amazon Smart Thermostat Now That 30% Off for Amazon Prime Day",
        "description": "Save 30% on the Alexa-enabled Amazon Smart Thermostat and transform your energy savings",
        "url": "https://gizmodo.com/amazon-reduced-its-smart-thermostat-pricing-by-35-and-you-can-reduce-your-energy-consumption-2000507616",
        "publishedAt": "2024-10-04T18:18:55Z",
        "content": " We are now more than a decade into the smart home era of consumer technology. If you have an Amazon Alexa or other branded smart home hub, there is a lot of cool stuff you can do with routines or just the power of your voice. Adjusting the lights in your living room when you pop on a movie or new episode of your favorite show, brew coffee at a scheduled time every morning, have a robot vacuum and mop the floors of your home, and much more. See at Amazon Well one of those awesome things you can do is control the temperature of your home. The Amazon Smart Thermostat does exactly that for you, can pair with your Alexa device, and right now it is even on sale. As part of a limited time deal, you can grab it for just $56 —a 30% discount. It is quick and easy to switch over from a traditional thermostat to a smart one, and doing so can help reduce your energy usage. The Amazon Smart Thermostat supports temperature sensors. You may not have known this, but Echo devices that are 4th or 5th generation have temperature sensors build into them. If you have several throughout your house, the Amazon Smart Sensor can get a much more accurate read on what the temperature is like throughout your home as opposed to just the area right in front of it. Being a smart thermostat, it can be fully controlled through Amazon Alexa. You might find yourself a little chilly on the couch, but the blanket is all the way over there. You do not wanna get up. Adjust the temperature from your phone in the Alexa app. Or better yet, just ask Alexa to turn up the thermostat by a degree or two so you can be cozy again. If already have a C-Wire, then great news. The Amazon Smart Thermostat on its own is a solid 30% off bringing the price down to just $56. This is part of a limited time deal as we lead up into October is Prime Day. According to EPA estimates, Energy Star certified thermostats save an average of $50 on yearly energy bills. Plus after your purchase, Amazon will send you an email with details about rebates from energy providers in your area so you can save even more."
    },
    {
        "title": "28 Best Early Amazon Prime Day Deals On Gear We've Tested (October 2024)",
        "description": "Amazon’s Prime Big Deal Days starts tomorrow, but we’ve already spotted the best Prime Day deals on products we’ve tested and loved.",
        "url": "https://www.wired.com/story/best-early-prime-day-deals-october-2024-1/",
        "publishedAt": "2024-10-07T15:31:01Z",
        "content": " Prime Day is over. We spent weeks prepping for Amazon is semiannual sale and two full days tracking discounts. Now all that is left is watching for packages and moving some money around in your bank accounts. Unless …\nYes, there are still a few Prime Day deals ticking. As always, WIRED is picks for the best leftover Prime Day deals include only products someone from our team has personally tested and reviewed. We have linked our reviews and buying guide throughout to help you make fully informed buying decisions. Some of the products on our original list are still discounted, but if the price has increased from yesterday we have removed them. You can shop these deals with confidence that today is price is, in fact, yesterday is price, if not tomorrow is. Also, do not fret if you missed out. Black Friday is just six weeks away.\nThe Best of the Leftovers\n\nAll the iPad you need: Apple iPad 10th Gen $300 ($$50 off)\nThe best bidet at its best price yet: Kohler Purewash Bidet for $424 ($373 off)\nCookie season: Nordic Ware Sheet Pan for $6 ($6 off)\nA great reading light: Glocusent LED Neck Reading Light for $19 ($17 off)\n\nAsus RT-AXE7800 Wi-Fi Router for $196 ($84 off)\nA buck cheaper than it was during Prime Day! Listed in our Best Routers guide as the best option for folks looking to try Wi-Fi 6E, this hexagonal Asus router performed well in my tests. It is a tri-band router, adding the 6-GHz band to the familiar 2.4-GHz and 5-GHz. The new band allows for much faster speeds but is relatively low range and does not penetrate through walls very well. This router has a 2.5-Gbps WAN/LAN port, a second 1-Gbps WAN/LAN, and three gigabit LANs. Asus also provides free security and parental controls and tons of options in the mobile app and browser interface, including band-splitting, prioritization for different activities, guest network, VPN support, and the list goes on. —Simon Hill\n\nRØDE Wireless Go II Microphones for $240 ($59 off)\nThis set of wireless microphones from Australian audio brand RØDE works well if you are always filming on the go. You just clip each mic to the lapel of the person you want to record, and it records wirelessly for you to use later. It is a really simple solution that makes it so you do not have to mess with traditional (and often annoying) Lavalier microphone setups like you have seen on late-night TV. —Parker Hall\nWestern Digital WD_BLACK 2TB SN770 for $119 ($41 off)\nThe Western Digital WD Black SN770 is our favorite bare drive, whether you are putting it in your laptop or PC or sticking it in an external case to use as a portable drive. The SN 770 is an M.2 2280 drive (check your PC is specs to see if that fits) and achieved speeds of 5,100 Mbps in my testing, which is blazing fast. If you are doing a lot of drive-intensive tasks, like editing video or gaming, this drive is well worth the money. —Scott Gilbertson Farrell\nLifx A19 Color Bulb (800 Lumen, Two-Pack) for $30 ($20 off)\nI am a big fan of Lifx bulbs for Apple Home users, since the bulbs will be ready for HomeKit setup when you initially unbox them. Not an Apple Home user? No problem—just wait 15 minutes and you can set these bulbs up to work without Apple and can instead link them to Google Assistant or Amazon Alexa. Right now I control both my Lifx bulb and my Lifx Beam (7/10, WIRED Recommends) with Google Assistant, and it is just as seamless as using it with Apple. The app is intuitive to navigate and comes with tons of colors and premade scenes you can use, and Lifx does not require a hub of any kind to work. They are easy to add onto any smart home, or to use as your exclusive smart home bulb, especially since they are on sale right now. The 800-lumen A19 bulb is on sale, and while it is not as bright as Lifx is higher-lumen bulbs, it is still plenty bright to use in a living room lamp alongside another light. —Nena Farrell\nAura Carver Mat Digital Photo Frame for $141 ($38 off)\nThe Aura Carver is our top pick for digital photo frames, but right now you can get the upgraded Carver Mat for the same price you would get the regular model for. The Carver Mat upgrades the 10.1-inch digital photo frame is look to give it a mat-style frame job, and looks much more than just a $30 upgrade. And right now that $30 extra is gone, thanks to Amazon Prime Day. Aura is a fantastic brand for digital photo frames thanks to how easy the frames are to set up and manage with the app, letting you easily add photos from your camera roll or Google Photos. You can even scan your kid is drawings with the Aura app to then display. —Nena Farrell\nAbode Lock for $130 ($30 off)\nThe Abode Lock (7/10, WIRED Recommends) is one of my favorite smart locks I have tested. This retrofit lock is easy to install, fairly quiet, and comes with a keypad and fingerprint reader. It only replaces the back of your deadbolt, making it a good pick for renters or households who want to keep using their existing keys. It does not require a hub, but adding the Abode Hub does give you smart home connectivity. The hub only comes in Abode is bundles, but you can get the Abode Security Kit for $40 ($120 off) right now. You will also want one of Abode is monthly subscriptions (I did the $7/month Standard Plan) to get detailed notifications. I know it sounds like a lot, but you will be able to build onto this setup as much (or as little!) as you want after getting both the lock and hub for such a good price. —Nena Farrell\n\nJump to a topic: Best Tech Deals, Best Home Deals, Best Kitchen Deals, Best Coffee Deals, Best Apple Deals, Best Smartwatch Deals, Best TV Deals, Best Laptop and Tablet Deals, Best Soundbar Deals, Best Headphone Deals, Best Speaker Deals, Best Gaming Deals, Best Charging Deals, Best Outdoor Deals, Best Camera Deals\n\nDyson V15 Detect Cordless Stick Vacuum for $627 ($124 off)\nThis V15 Detect continues to hold the top spot in our guide to Best Dyson Vacuums. At just under 7 pounds, it is lightweight, making it easy to maneuver and handle. It also comes equipped with a green laser that shoots out the front of the motorized head, illuminating microscopic dust particles that are typically tough to see. There is a sensor inside the vacuum as well, which counts the number and determines the size of the particles it is sucking up—all of which you can see on the LCD. In terms of battery life, you will get a 60-minute run time with a battery that takes up to 4.5 hours to fully charge. It is expensive, but it is an excellent option if you are looking for a high-performing stick vacuum. —Brenda Stolyar\nDyson Ball Animal 3 Upright Vacuum Cleaner for $299 ($119 off)\nDyson is Ball Animal 3 vacuum (9/10, WIRED Recommends) is great for unruly pet hair. It has more bin capacity than the previous version and comes with a Motorbar cleaner head with detangling hair-removal vanes. It has three different power modes to choose from: one for deep- and medium-pile carpets, another for low-pile carpets and large debris, and one for ground-in dirt and hardwood floors. It is easy to maneuver, especially around awkward spaces and tight corners, and the bin never clogs up with fur. It is heavy and loud, though. But aside from that, it is an excellent corded vacuum for pet owners. —Brenda Stolyar\nShark Matrix Plus 2-in-1 Robot Vacuum for $400 ($300 off)\nThe Matrix is the newest version of the Shark AI Ultra, the 2-in-1 mopping vacuum that earned a Most Improved Award from me in 2022. Like most companies that purport to offer maximum value for minimum price, Shark has products that can be hit or miss. Happily, however, the Matrix is one of the hits, as I found it to be a reliable cleaning companion with quick and accurate mapping, multifunctional mopping, and vacuuming. It does not need replacement dust bags—which is both a blessing and a curse, as the self-emptying dustbin sometimes does not empty quite all the way. —Adrienne So\nShark NeverChange Air Purifier Max for $280 ($50 off)\nWhen I included the rocket-shaped Shark NeverChange Air Purifier Max in WIRED is lineup of the Best Air Purifiers of 2024, I recommended it as the ideal gift for your dorm-bound loved ones. Standing just under 2 feet tall, the NeverChange can be placed as close as 3 inches from a wall, making it a good fit for crowded spaces. The average American dorm room is around 230 square feet, and the Shark NeverChange succeeds at exchanging the air the five recommended times per hour—perfect for a multiple-person dorm room. One caveat: To achieve that level of air purification, the NeverChange must be at its highest setting, which is to say its loudest setting. The NeverChange HEPA filter captures fine particles along with an activated carbon filter to trap odors and gases. It also includes Shark is own Odor Neutralizer Technology, a small cartridge filled with an Ocean Breeze fragrance pod that looks like solid perfume. I would skip this, as I did not care for the scent. —Lisa Wood Shapiro\nCasper Hybrid Snow Pillow for $135 ($16 off)\nThis is our top pick in our Best Pillows guide, and it is not hard—in fact, it is rather soft and squishy—to see why. I live in Texas, where it is summer nine months out of the year, and this pillow still manages to stay cool throughout the night. It features a multilayer structure with a sturdy foam core to keep its shape, flanked by softer memory core layers to cushion your head. No matter how many pillows I test, I keep finding myself reaching for this one when I need a really good nap. —Eric Ravenscraft\nNest Cam Indoor (Wired) Security Camera for $70 ($30 off)\nThis is one of the best indoor security cameras you can buy because it is capable of recognizing faces, so it can tell you when your kids come home. I also like the understated style. With HDR, the 1080p video quality is clear at 30 fps, with automatic night vision when it is dark. There is also decent two-way audio, and enforced two-factor authentication, which is important for an indoor camera. The big downside is that you need a Nest Aware subscription costing $8 per month ($80/year) for 30 days of event video history and familiar face alerts, but that does cover all your Nest devices. —Simon Hill\nNest Cam Outdoor Security Camera 2 Pack for $240 ($90 off)\nThe perfect outdoor security camera for Google households, Nest Cam Outdoor has a handy magnetic mount that makes it easy to angle the camera. It has an expansive 130-degree field of view, captures sharp 1080p video with HDR and night vision, and boasts a clear speaker and microphone. You only get three hours of free event history, but you can add a Nest Aware subscription ($8 a month, or $80 for the whole year) to get 30 days of event history and face recognition, which is super handy. —Simon Hill\nPetivity Smart Litterbox Monitor System for $89 ($139 off)\nPurina is Petivity (8/10, WIRED Recommends) is a more affordable way to monitor your cat is health without having to fork over $700 for an automatic litter box. The Petivity sits underneath a standard litter box and, once connected to the app, tells you which cat visited the box at what time, how much they weigh, and if they went number one or two. This tool is perfect for the helicopter pet parent, so you can track any differences in their litter box usage and if something seems off, take them to the vet before the issue becomes bigger and more costly. Right now the Petivity is the lowest price we have seen for an expensive pet health monitoring tool—less than half of what it usually costs. —Molly Higgins\nDeWalt 20V Max 1/2-Inch Cordless Drill for $99 ($80 off)\nA good drill is essential for your home tool kit, and this is the best one we have tested. It is got more than enough torque for most tasks—and  notis better to have more torque and not need it than to need it and not have it. The bundle includes two batteries and a charger, and the chuck will accept every bit you will end up using. The included batteries can be swapped with other DeWalt power tools as well. —Louryn Strampe\nNuzzie Ice Knit Weighted Blanket for $207 ($52 off)\nThe Nuzzie Ice Knit weighted blanket is one of my top weighted blanket picks, and a great alternative to the popular Bearaby Tree Napper if you want something extra soft or have a specific weight you are looking for. It is a similar open-knit design, and both use weighted fabric as filler rather than beads, but the Nuzzie uses bamboo material to give it a silkier, cooling touch. It has different weight options than the Bearaby Tree—the Nuzzie comes in 12, 16, 22, and 28 pounds—and I personally found those offerings closer to 10% of my weight. I just had a friend come over and they immediately commented on how nice the Nuzzie was to sit under while watching a movie. —Nena Farrell\n\nJump to a topic: Best Amazon Device Deals, Best Tech Deals, Best Home Deals, Best Kitchen Deals, Best Coffee Deals, Best Apple Deals, Best Smartwatch Deals, Best TV Deals, Best Laptop and Tablet Deals, Best Soundbar Deals, Best Headphone Deals, Best Speaker Deals, Best Gaming Deals, Best Charging Deals, Best Outdoor Deals, Best Camera Deals\n\nNordic Ware Sheet Pan for $6 ($6 off)\nCookie season is just around the corner. We swear by these baking sheets from Nordic Ware. They have lasted our reviewer over a decade so far, with zero warps or other issues. Right now you can literally get two for the price of one, so if you are baking on secondhand sheets that just are not cutting it, it is a good time to invest in this upgrade. —Louryn Strampe\n\nNinja Max XL Air Fryer for $110 ($60 off)\nIn a world where appliances are constantly vying for countertop space, the Ninja Max XL has a nice compact footprint that should make it fit in neatly with whatever else is currently residing there. It boasts a few different settings including roasting, baking, and crisping—so whether you are whipping up some curly fries or you are crafting a birthday cake, this gadget can still be useful. Read more about it in our air fryer buying guide. —Louryn Strampe\nInstant Pot Vortex Plus Air Fryer Oven for $130 ($40 off)\nThis little gadget is one of our favorite air fryers, partially because it is actually not so little. The 6-quart capacity can make up to six servings of food at once, so it is great for larger households. You will get six cooking modes, including fry, roast, broil, bake, reheat, and dehydrate. The best part is the large viewing window, which lets you check the progress of your food without having to drop the internal temperature. The air fryer has a wide temperature range, and there are built-in filters that help cut down on any odors. Though I, for one, would not be mad if my kitchen smelled like steak bites all the time. —Louryn Strampe\n\nJump to a topic: Best Amazon Device Deals, Best Tech Deals, Best Home Deals, Best Kitchen Deals, Best Coffee Deals, Best Apple Deals, Best Smartwatch Deals, Best TV Deals, Best Laptop and Tablet Deals, Best Soundbar Deals, Best Headphone Deals, Best Speaker Deals, Best Gaming Deals, Best Charging Deals, Best Outdoor Deals, Best Camera Deals\n\nBreville Barista Express Espresso Machine for $550 ($150 off)\nOur top pick in our Best Espresso Machines guide, this is the machine to buy if you are looking for a step up from a Keurig. I have been using mine since 2018 and it has served me well for more than six years. It is quick to turn on, has a built-in grinder, a tamper that stores magnetically, and there is a steam wand that can froth milk for a latte, though it takes a while. —Julian Chokkattu\nBreville Barista Express Impress for $700 ($200 off)\nThe Barista Express Impress (6/10, WIRED Review) is a more feature-rich version of our favorite espresso machine above. It has more grind and dosage settings, and it automates some of the more complex parts of brewing espresso, such as getting just the right amount of grounds per shot. Otherwise, it is largely the same. It is got a built-in grinder, an adjustable steam wand, and a sturdy construction. We see this deal on a regular basis, but the discount is still good. —Louryn Strampe\n\nDelonghi Specialista Arte Evo Espresso Machine for $500 ($250 off)\nThis very fancily named espresso machine made our list of the very best. It is a two-in-one machine with a built-in grinder and a slim form factor compared to similar machines. It has a couple of quirks—like the stepstool for your mug to prevent splashing—but overall it is a joy to use and if you are spending money like crazy on artisan coffee drinks at your local shop, the investment will pay off. We have seen it drop as low as $500 before, but it rarely drops below $550, so we still think this is a decent deal. —Louryn Strampe\n\nJump to a topic: Best Amazon Device Deals, Best Tech Deals, Best Home Deals, Best Kitchen Deals, Best Coffee Deals, Best Apple Deals, Best Smartwatch Deals, Best TV Deals, Best Laptop and Tablet Deals, Best Soundbar Deals, Best Headphone Deals, Best Speaker Deals, Best Gaming Deals, Best Charging Deals, Best Outdoor Deals, Best Camera Deals\n\nApple iPad 10.2-Inch Tablet (9th Gen, 2021) for $199 ($50 off)\nEven though we do not consider the 9th Gen iPad (8/10, WIRED Recommends) the best for most people—mainly because it is three years old and packs an older, A13 Bionic chip—it is still a solid option if you are in the market for a budget tablet. It is affordable and comes with a ton of great features like a physical Touch ID-enabled home button, 64 GB of storage on the base model, a 12-megapixel rear camera (with support for Center Stage), and a True Tone display. It is also compatible with accessories like the 1st Gen Apple Pencil and Apple is Smart Keyboard. —Brenda Stolyar\nApple iPad Air 13-Inch Tablet (M2, 2024) for $749 ($50 off)\nThis is the latest iPad Air (8/10, WIRED Recommends). It now comes in two sizes: 11 inches and 13 inches. The latter is bigger and brighter, making it excellent to use as a secondary display to work off of or watch TV on. It also comes equipped with an M2 processor (the same one that powers the 13-inch MacBook Air and MacBook Pro from 2022) that delivers smooth performance even with multiple apps running simultaneously. Apple also moved the front-facing 12-megapixel camera to landscape orientation. As with the previous version, it also has a USB-C port, slim bezels, and Touch ID built into the top power button. —Brenda Stolyar\niPad Mini (6th Gen, 2021) for $350 ($89 off)\nThe iPad Mini (8/10, WIRED Recommends) is my favorite tablet to travel with. The 8.3-inch display is great for watching movies, sketching, notetaking, and reading ebooks. It also has Touch ID built into the power button, a front-facing camera with Center Stage, and an A15 Bionic processor (as seen on the iPhone 13) that can handle taxing apps or games. It is worth noting this model came out in 2021, and Apple is expected to announce the next-generation version either in November or early 2025. I recommend waiting if you can. —Brenda Stolyar\nApple iPad (10th Generation) for $299 ($20 off)\nThe iPad (10th Gen) (7/10, WIRED Review) is our favorite iPad for most people. It comes with a large 10.9-inch Liquid Retina (IPS LCD) display, a touch ID sensor integrated into the power button, a USB-C port instead of Lightning, and a 12-megapixel rear camera (an upgrade from the eight megapixels). The 12-MP selfie camera has also been moved to the center of the iPad, so you will no longer have to awkwardly stare to the side during video calls. Under the hood is also an A14 Bionic chip, which delivers slightly faster performance and a bump in graphics over its predecessor. —Brenda Stolyar\nApple Pencil Pro Stylus for $96 ($33 off)\nThis is the latest and more feature-packed Apple Pencil. It comes with a few noteworthy features including a squeeze capability that triggers the tool palette (but you can still use double-tap) along with a haptic engine inside that delivers feedback when you squeeze the stylus. There is a built-in gyroscope sensor too, which allows you to change the orientation of the tools as you twist it for finer control. It also comes with support for Apple is Find My Network in case you lose it. It is worth noting, however, that it only works with the iPad Air (M2) and iPad Pro (M4). —Brenda Stolyar\nMacBook Pro 14-Inch Laptop (M3, Late 2023) for $1,299 ($300 off)\nAlthough M4-powered MacBooks are imminent, the MacBook Pro with M3 launched just a year ago—so it is still an excellent choice. It packs a brighter display with mini LED and a 120-Hz refresh rate, along with a 1080p webcam. It packs plenty of ports too, including two USB-C ports with Thunderbolt 4, an HDMI, a MagSafe charging port, a high-impedance headphone jack, and an SD card slot. We recommend it if you are looking for a MacBook Pro without spending $2,00 or more. —Brenda Stolyar\n\nJump to a topic: Best Amazon Device Deals, Best Tech Deals, Best Home Deals, Best Kitchen Deals, Best Coffee Deals, Best Apple Deals, Best Smartwatch Deals, Best TV Deals, Best Laptop and Tablet Deals, Best Soundbar Deals, Best Headphone Deals, Best Speaker Deals, Best Gaming Deals, Best Charging Deals, Best Outdoor Deals, Best Camera Deals\n\nSamsung Galaxy Watch7 Wear OS Smartwatch for $260 ($40 off)\nThe best smartwatch for Samsung fans, the Galaxy Watch7 is a very nice companion for a Galaxy phone. It is packed with features, offers notifications from your phone, and allows you to control your smart home from your wrist. It even boasts artificial intelligence algorithms to improve your health tracking data. But the battery life could be better and it does not add much over the much cheaper, older Watch6. —Simon Hill\nOura Ring Gen3 Horizon for $299 ($51 off)\nDiscounts on Oura is biohacking smart rings are rare, but the Oura Ring Gen3 Horizon (6/10, WIRED Review) is currently on sale for Prime Day (no doubt because the Oura Ring 4 is about to land). This smart ring is our favorite sleep tracker and does a solid job of tracking your activity and stress levels. It packs three hospital-grade sensors: infrared photoplethysmography sensors for heart rate and respiration, a negative temperature coefficient (NTC) sensor for body temperature, and a 3D accelerometer for movement. The app is easy to use, but you must factor in Oura is $6-per-month membership, which is essential to get the most from this gadget. —Simon Hill\nWithings ScanWatch 2 Fitness Tracker for $200 ($50 off)\nIf you prefer a traditional analog-looking watch but want some of the features of a smartwatch, then the Withings ScanWatch 2 (7/10, WIRED Recommends) would like a word. With a classy design, comprehensive health and sleep tracking, and long battery life, this is one of the best smartwatches you can buy. It tracks your temperature, heart rate, and blood oxygen levels, and has an ECG feature. The screen is tiny, so you can not do much on it, but you can get notifications from your phone ticker-tape-style if you want. —Simon Hill\nMobvoi Ticwatch Pro 5 Enduro for $262 ($88 off)\nMobvoi is Ticwatch smartwatches have long been a bit bland but they also deliver some of the best battery life on a feature-rich smartwatch. That is because they use two kinds of displays, one low-power screen for when you are not staring at the watch, and then an OLED for when you are interacting with it. This watch performs well and lasts four days on a charge, but Mobvoi has a spotty record when it comes to software updates, so just know that you may not get the latest Wear OS features for months, if not a year. —Julian Chokkattu\nOnePlus Watch 2 Wear OS Smartwatch for $250 ($50 off)\nOnePlus is first Wear OS watch is excellent (7/10, WIRED Recommends). Similar to the Ticwatch, it employs a hybrid architecture running two operating systems and two processors—one handles all the graphics-intensive Wear OS tasks, and the other sips on power for mundane step tracking and the like. I got three days of juice on a single charge, though you can stretch this if you optimize the watch and conserve power. It is not as well-rounded in the health and fitness tracking department, but it is adept at controlling smart home devices, notifications, and music playback. —Julian Chokkattu\n\nJump to a topic: Best Amazon Device Deals, Best Tech Deals, Best Home Deals, Best Kitchen Deals, Best Coffee Deals, Best Apple Deals, Best Smartwatch Deals, Best TV Deals, Best Laptop and Tablet Deals, Best Soundbar Deals, Best Headphone Deals, Best Speaker Deals, Best Gaming Deals, Best Charging Deals, Best Outdoor Deals, Best Camera Deals\n\nLG 65-inch C3 4K HDR OLED TV for $1,297 ($200 off)\nLG is C-series OLED models are consistently among our favorite TVs of the year. The C3 (9/10, WIRED Recommends) is another stunner thanks to its perfect black levels and nearly infinite contrast, bright and naturalistic colors, and excellent clarity and detail. As a 2023 model, the C3 is not quite as bright as the current version, but it is still well worth grabbing on a good sale. Along with its fabulous picture quality, the TV provides four HDMI 2.1 ports for high-end gaming features on any input, a snappy (if a bit stodgy) webOS interface, and a stylish and refined aesthetic. You will want to check out the C4 is sale price too, but I would not hesitate to pick up the C3 on clearance. In fact, that is exactly what I did when I purchased my year-old LG C1 a few years back, and I have not regretted that decision for a second. —Ryan Waniata\nTCL 55-inch Q Class 4K QLED for $268 at Walmart ($30 off)\nWe like TCL Q Class TVs though we prefer the Q6 which we have named Best TV overall. But this is a nice savings on a 55-inch one step down. —Martin Cizmar\nLG 65-inch C4 OLED for $1,497 ($203 off)\nLG is C4 OLED is one of the prettiest TVs I have ever seen (9/10, WIRED Recommends). It has perfect contrast, a great interface, and a 144hz refresh rate that makes it great even for PC gaming. It is an OLED TV that is finally bright enough to watch in rooms with lights on, and it supports Dolby Vision high dynamic range, which comparable Samsung models do not. If you have been in the market for a high-end TV, this deal makes now a good time to buy. —Parker Hall\nHisense 65-inch U7N 4K HDR TV for $748 ($100 off)\nHisense is middle-tier min LED TV (8/10, WIRED Recommends) is a fantastic value, especially at this price which is the lowest we have seen all year. Those after sparkling brightness matched by excellent contrast will find this TV delivers, thanks to rich and deep black levels with very little blooming. You will also get expansive quantum dot colors and great gaming features like a dedicated gaming mode and VRR (Variable Refresh Rate) in 4K at up to 144 Hz thanks to HDMI 2.1 support across two of its four HDMI ports. It finishes things off with an inviting Google TV interface for an excellent all-around experience. At this price, it is honestly hard to go wrong, which is why it is currently our pick as the best TV for most people. —Ryan Waniata\nSamsung 65-inch S95D 4K HDR QD-OLED TV for $2,598 ($500 off)\nSamsung is S95D QD-OLED, the third model in the company is return to OLED displays, is a different animal than its predecessors. It is the first to offer a new matte screen that reduces direct and indirect reflections with impressive efficacy. That makes it great for those with sunny rooms or lots of reflective lighting, though it can create a slight loss in perceived picture depth for dark content in bright lighting. Still, as one of the brightest OLED TVs you can buy, it absolutely sizzles with HDR content day or night, while its excellent picture processing and quantum dot colors burst to life in everything you watch. It is loaded with extras, including support for the top gaming features across all inputs, but like all Samsung TVs, it does not support Dolby Vision HDR. This will not be the perfect fit for everyone, but if you are after phenomenal OLED performance that keeps reflections at bay, the S95D is a great buy—especially on sale. —Ryan Waniata\nHisense 65-inch U8N 4K HDR TV for $998 ($150 off)\nHisense is 65-inch U8N (8/10, WIRED Recommends) is one of the brightest TVs I have ever seen, with only the masterful Bravia 9 matching its wattage in our test pile so far. This baby will blow the doors off your last TV, but just as important as those blistering highlights are its fantastic black levels and rich colors for well-rounded spectacle in HDR and even dimmer SDR (Standard Dynamic Range) content. It matches its punchy picture with top-tier gaming features, a solid Google TV interface that is easy to setup and use, and some features you might not expect like an adjustable optical audio port that automatically lets you control the volume of older audio systems with your TV remote. If you are after the best TV experience you can get for under $1,00, the U8N drops the hammer. —Ryan Waniata\nSony Bravia Theatre Quad Home Theater System for $2,098 ($400 off)\nSony is all-in-one Quad home theater system (8/10, WIRED Recommends) provides the best surround sound immersion I have heard in a single-box solution. Even more intriguing, the four fabric-lined cubes and small control box are brilliantly discreet, mounting to the wall and requiring only power outlets and a single HDMI connetion to your TV. That makes the setup great for those who want to bring the theater experience home without all the clutter. You will likely want to add one of Sony is wireless subwoofers so the end cost is certainly steep, but this price drop makes the Quad seriously enticing for those after a stealthy setup that brings the goods. —Ryan Waniata\nRoku Ultra Streaming Box for $79 ($20 off)\nOf the many, many options in the Roku lineup, Roku Ultra is the fanciest. It has the strongest dual-band Wi-Fi you can get in a Roku, plus an Ethernet port if you prefer wireless connections. We do not really think that is necessary, but if you care, the option is there. The remote has an option for hands-free voice controls as well as a headphone jack. Roku even throws a free pair of earbuds in, and they are surprisingly decent—and you will not wake up your sleeping partner while you binge the newest season of What We Do in the Shadows. Another neat feature is that if you have hands-free voice controls turned on, you can speak into the void and ask your remote to beep. We truly live in the future. —Louryn Strampe\nRoku Express 4K Plus Streaming Stick for $27 ($13 off)\nThe Roku Express 4K+ is similar to the one we recommend in our guide. The main difference is that this slightly cheaper model does not have a Voice Remote Pro, therefore it does not have a headphone jack. If you do not care about using voice controls or listening to your TV via headphones but want a capable streaming stick with loads of free channels and a dead-simple interface, this is a good model to get to save some cash. We have seen this drop to $25 before, but $27 is still a good deal since it usually bounces between that and $40. —Louryn Strampe\nRoku Streaming Stick 4K for $34 ($16 off)\nRoku is simple and easy-to-use interface is probably my favorite in all of streaming TV land. It has virtually every app you can fathom, excellent voice search, and pumps out surprisingly great video quality from a device the size of a gum packet. I would still go for a higher-end streamer for my main TV, but if you have an older screen that needs a streaming upgrade or has an interface you hate, this is one of our favorite streaming devices. —Parker Hall\nRoku Express Streaming Stick for $18 ($12 off)\nIf you do not have a 4K TV, you do not need to pay extra for a 4K streaming stick. The Roku Express is the cheapest in the lineup, but it is perfectly capable. It is a bare-bones device that does not have any fancy extra features like voice or TV controls, but you will still get the beloved Roku interface and access to all of your usual streaming networks. Lots of other Roku devices are on sale for Prime Day, though, so if you plan on upgrading your TV over the next few years, it might be worthwhile to just spend the extra cash on a more future-proof device now. —Louryn Strampe\n\nJump to a topic: Best Amazon Device Deals, Best Tech Deals, Best Home Deals, Best Kitchen Deals, Best Coffee Deals, Best Apple Deals, Best Smartwatch Deals, Best TV Deals, Best Laptop and Tablet Deals, Best Soundbar Deals, Best Headphone Deals, Best Speaker Deals, Best Gaming Deals, Best Charging Deals, Best Outdoor Deals, Best Camera Deals\n\nMicrosoft Surface Laptop (7th Edition, 2024) for $1,400 ($200 off)\nThis is the first major discount we are seeing on Microsoft is latest Surface Laptop (which is also a Copilot+ PC, which we explain in this story). It is a perfectly fine machine (7/10, WIRED Recommends) but was too expensive out of the gate. This price is a little more reasonable, especially since this is the version with the Snapdragon X Elite chipset, 16 GB of RAM, and a 1-terabyte solid state drive. You also get a 14-inch touchscreen with a 120-Hz screen refresh rate. Performance is great for everyday tasks with good battery life, just take a grain of salt with all the AI features. Also remember that since this is a Qualcomm-powered PC, there may be some app compatibility issues. —Julian Chokkattu\n\nAcer Chromebook Plus 516 GE for $549 ($100 off)\nGaming on a Chromebook? It is not something you immediately think of on these machines that revolve around the Google Chrome browser. Still, the 516 GE (8/10, WIRED Recommends) is one of the more powerful Chromebook Plus laptops out there with battery life that will get you through a workday just fine. It is billed as a cloud gaming machine, allowing you to stream games through services like Xbox Cloud Gaming or Nvidia GeForce Now. There is Wi-Fi 6E support or an Ethernet port to maximize internet speeds. Plus you get a 16-inch screen with a 120-Hz refresh rate. —Julian Chokkattu\n\nJump to a topic: Best Amazon Device Deals, Best Tech Deals, Best Home Deals, Best Kitchen Deals, Best Coffee Deals, Best Apple Deals, Best Smartwatch Deals, Best TV Deals, Best Laptop and Tablet Deals, Best Soundbar Deals, Best Headphone Deals, Best Speaker Deals, Best Gaming Deals, Best Charging Deals, Best Outdoor Deals, Best Camera Deals\n\nSonos Ray Soundbar for $169 ($30 off)\nThe Ray (9/10, WIRED Recommends) is an intriguing offering from Sonos, a brand that is helped redefine the soundbar landscape. It does not connect over HDMI ARC like most modern soundbars, using an optical input instead. That means it is tougher to control it with your TV remote, though it is programmable for many modern TVs which is important since it oddly does not come with its own remote. The tradeoff is advanced networking features like Spotify Connect, Apple AirPlay 2, and the ability to connect with other Sonos speakers for a whole-home audio system. Most important, this compact bar sounds very good for its size, with more bass and overall punch than you would believe when you unpack it. The Ray is not for everyone, but if it fits your needs, it is a hot attraction at a cool price. —Ryan Waniata\nSonos Beam Gen 2 Soundbar for $399 ($100 off)\nThe Sonos Beam Gen 2 sits in the middle of the company is current lineup, offering a balanced blend of sound quality and features. It is not particularly punchy in the bass, but its compact size serves up clear dialogue and surprisingly expansive effects sound thanks to acoustic trickery that includes virtual Dolby Atmos support. Like other Sonos speakers, it offers advanced networking features, including a variety of supported streaming services, AirPlay 2, and the ability to connect to other Sonos speakers over Wi-Fi for a multi-room or surround sound setup. Its minimalist design disappears on your console, and the HDMI ARC connection makes it simple to control with your TV remote. Those who want bigger sound may want to step up to the Arc, but the Beam is a solid compact system with loads of features. —Ryan Waniata\nLG S95TR Dolby Atmos Soundbar System for $997 ($288 off)\nDolby Atmos Soundbar systems are frowned upon by the nerds on Reddit, but I actually have found that recent generations do compete pretty well with traditional receiver-and-speakers setups. This one from LG is usually a bit expensive for most buyers, but at under a thousand bucks for a setup with two rear surround speakers with upfiring drivers and a wireless subwoofer, it is hard to argue with this deal. It even has Dolby Vision and 120hz 4K passthrough, which means you can connect your latest consoles and not worry that it is throttling the video. —Parker Hall\nSonos Arc Soundbar for $719 ($130 off)\nSonos' indomitable Arc (9/10, WIRED Recommends) helped change how we think about soundbars. At nearly $900 list, its lack of extras like a subwoofer or surround speakers seemed like a serious hindrance. Instead, the tubular device proved that a single bar is all you need for thrilling home theater audio, with solid bass response and powerful speakers that bounce sound all around your room. Its Dolby Atmos height speakers are particularly impressive, submerging you in sound with supported content. Of course, if you want more, the Arc happily obliges by connecting wirelessly with other Sonos speakers in a multiroom audio system, or a full 5.1.2 Dolby Atmos setup. It is got plenty of other features, including a built-in microphone for smart commands and the ability to stream over Wi-Fi from multiple services. It does not offer Bluetooth or even a spare HDMI input, but if you are looking for a topline, all-in-one sound system, it is one of the best soundbars out there. —Ryan Waniata\n\nJump to a topic: Best Amazon Device Deals, Best Tech Deals, Best Home Deals, Best Kitchen Deals, Best Coffee Deals, Best Apple Deals, Best Smartwatch Deals, Best TV Deals, Best Laptop and Tablet Deals, Best Soundbar Deals, Best Headphone Deals, Best Speaker Deals, Best Gaming Deals, Best Charging Deals, Best Outdoor Deals, Best Camera Deals\n\nApple AirPods Max for $395 ($34 off)\nMany of us thought the AirPods Max (8/10, WIRED Recommends) was getting a refresh at the most recent Apple event, but all we got was a USB-C version fit for European consumption. That means this discounted model is still Apple is top of the pops, and indeed it still stands tall in the noise-canceling headphones lexicon. You will get a solid aluminum design that feels posh, great sound, good noise canceling, and transparency mode that brings in the world around you in and incredibly natural way. You will also get good Apple-centric features like the ability to seamlessly swap between iCloud devices These headphones are rather heavy and do not come with a travel case, but otherwise they are still an excellent buy, especially now that the price has crept down drastically from their original $600 MSRP. —Ryan Waniata\nBeats Studio Pro for $170 ($130 off)\nThe Beats Studio Pro (7/10, WIRED Recommends) are a super solid pair of headphones that cost just a bit too much at full price for them to rise to my exclusive list of top favorites. That is why they are so enticing on a great sale. These headphones offer excellent audio performance and noise canceling, natural sounding transparency mode, some good Apple-centric features (since Apple owns the Beats brand), and even trendy tricks like 360 audio with head tracking that puts you in the center of your sound. I wish they had auto-pause, something I expect in a pair of top-tier headphones, and the build is less premium than other headphones in their class but at this price, they are nothing less than a killer deal. —Ryan Waniata\nBeats Studio Buds + Wireless Earbuds for $130 ($30 off)\nThese are our favorite AirPods alternatives. They have noise cancellation, support for spatial audio, and transparency mode. Although they are not the most comfortable earbuds we have tested, they are very easy to use, thanks to the physical buttons on the outside of each earbud. We also like that they are super stylish and come in colors like ivory, silver, black, and transparent. —Brenda Stolyar\nBeats Fit Pro for $150 ($49 off)\nThe Beats Fit Pro (9/10, WIRED Recommends) is best for the gym, due to its ergonomic design. They have squishy fins for better stability, soft silicone tips, and a fit test to make sure the buds sit properly in your ears. The outside of each bud also has a clicky button used for controls. In terms of sound, they also deliver a detailed and punch sound signature, excellent noise cancelation, and reliable microphones for calls. —Brenda Stolyar\nSony WH-100XM5 Wireless Headphones for $298 ($52 off)\nSony is WH-100XM5 (9/10, WIRED Recommends) are the brand is top wireless pair, offering excellent noise canceling, great sound, and tons of advanced features. Even with a couple of years under their belt, the XM5 do well to fend off fresh rivals like the Sonos Ace. They can not match the Bose Ultra when it comes to noise canceling, but I generally prefer their sound quality, especially after taming their taut bass with Sony is multi-band EQ. There is not a major feature the XM5 do not offer, from auto pausing when you speak to letting in the world around you with a cupped hand on the right earcup. Perhaps their best feature is usability, with everything from their touch controls to their app working flawlessly. Their 30 hours of battery life is enough for even trips off the grid. Their only real knock is a longer travel case than their predecessor, the WH-100XM4 that is harder to pack. The XM5 are among the best wireless headphones out there, and they are all the more tempting on a good sale. —Ryan Waniata\nBose QuietComfort Ultra Earbuds for $229 ($40 off)\nWith so much marketing hype in consumer electronics, it is nice to see a product that lives up to its name. When Bose says Ultra in this case, the company means it. You will not find a pair of earbuds with noise canceling this powerful or comprehensive anywhere on the market right now. Others may come close, but when it comes to strangling as much of the ambient audio around you as possible, these buds stand alone. They add to their cancellation prowess with clear and vibrant sound performance, solid battery life, and extras like adaptive transparency mode to keep sudden loud noises at bay and 3D audio with head tracking to immerse you in your tunes and videos. If you have been waiting for a good sale on the ultimate noise cancellers, now is your moment. –Ryan Waniata\nSony WF-100XM5 Wireless Headphones for $228 ($50 off)\nSony is WF-100XM5 (7/10 WIRED Recommends) are every bit a flagship pair of Sony earbuds. They do not have the best noise canceling or arguably even the best sound for the money, but their mix of top-tier versions of each alongside a wide suite of useful features and technologies makes them an excellent sonic companion even at their high price. Their design is more compact and ergonomic than many competitors, fitting nimbly in your pocket and your ears. Their touch controls are simple to use, and their 8 hours of battery life per charge (and multiple case recharges) is among the best in class. It all adds up to a well-rounded package that is especially tempting on sale. —Ryan Waniata\nShokz OpenRun Pro for $125 ($55 off)\nThis comes with the major caveat that Shokz recently released the update to these longtime favorite headphones, the OpenRun Pro 2, which have, among other things, USB-C charging so you are not constantly looking for Shokz is proprietary charger. However, the older version is still great—it is smaller, the battery life is slightly better, and the sound quality is also just a tiny bit better. There is also a mini version for those of us with tiny, tiny necks. —Adrienne So\nSony Linkbuds S for $128 ($22 off)\nSony is Linkbuds S do not seem to have much in common with their namesake, the original Linkbuds (8/10, WIRED Recommends). The latter have a hole in the middle to eternally let in the outside world, while the Linkbuds S are more like traditional earbuds, offering both transparency mode and noise canceling, allowing you to let in or suppress environmental sounds respectively. This makes them more of a philosophical follow-up, but they are still a solid pair of midrange earbuds. Their best feature may be their minuscule size, making them comfy and easy to wear for hours at a time. You will also get plenty of features, including a multi-band EQ and a speak-to-chat feature that pauses sound when you talk. It is a good package, especially at their reduced price, making these a worthy buy for those after Sony quality without shelling out for a flagship pair. —Ryan Waniata\nAltec Lansing Kid Safe ANC Headphones for $25 ($5 off)\nIf you are getting headphones for your kids you should always make sure they are volume-limited to ensure they do not damage their hearing. This pair from Altec Lansing are limited to 85 decibels but also have active noise cancellation to block out background noise. They come in various fun color combos, are wireless, and work for up to 15 hours when fully charged. My kids tested these and my wife uses them at school (she is a teacher) and the students find them comfy. They also score an IPX4 rating and wipe clean easily. —Simon Hill\n\nJump to a topic: Best Amazon Device Deals, Best Tech Deals, Best Home Deals, Best Kitchen Deals, Best Coffee Deals, Best Apple Deals, Best Smartwatch Deals, Best TV Deals, Best Laptop and Tablet Deals, Best Soundbar Deals, Best Headphone Deals, Best Speaker Deals, Best Gaming Deals, Best Charging Deals, Best Outdoor Deals, Best Camera Deals\n\nCreative Pebble V3 Speakers for $30 ($5 off)\nSpeakers this cute—and cheap!—sound like a recipe for poor performance. Luckily, Creative is pint-sized Pebble V3 speakers can deliver great sound quality for all my gaming and meeting needs. Midrange and bass notes come through nicely, and there is a single gain switch you can flip on too. The speakers connect via USB-C, Bluetooth, or the included 3.5-mm audio cable. All three work great, but the audio cable is my favorite for switching back and forth between my work laptop and gaming computer. Want a subwoofer? Creative also has the Pebble Plus 2.1 set on sale for $37 which adds a little subwoofer to pump up your sound with the two adorable Pebble speakers. —Nena Farrell\n\nJump to a topic: Best Amazon Device Deals, Best Tech Deals, Best Home Deals, Best Kitchen Deals, Best Coffee Deals, Best Apple Deals, Best Smartwatch Deals, Best TV Deals, Best Laptop and Tablet Deals, Best Soundbar Deals, Best Headphone Deals, Best Speaker Deals, Best Gaming Deals, Best Charging Deals, Best Outdoor Deals, Best Camera Deals\n\nPlayStation 5 Slim for $449 ($50 off)\nThe PlayStation 5 Slim is the new smaller version of the popular Sony console. You can read about the differences here. You may want to save for the PS5 Pro coming next month. —Martin Cizmar\nCorsair K65 Plus 75 Percent Gaming Keyboard for $120 ($40 off)\nThe Corsair K65 Plus is one of our favorite keyboards, especially if you want to take it on the go. The 75 percent layout keeps the dedicated arrow keys, but cuts off most of the other less-than-necessary keys to help keep it low-profile. It has a stylish volume knob, and connects via Bluetooth, USB-C, or a wireless dongle that you can store in the keyboard itself. —Eric Ravenscraft\nScuf Instinct Pro Xbox Controller for $195 ($35 off)\nIf you are looking for an upgrade over the typical Xbox controllers, the Scuf Instinct Pro is our top choice. It has a comfortably grippy matte black finish and a stylish color palette. On the rear, there are four hair-trigger paddles that can be mapped to any button, making it easier to juggle abilities in complex, fast-paced games like Overwatch 2 or Destiny 2. —Eric Ravenscraft\nSamsung Odyssey G6 OLED Gaming Monitor for $650 ($150 off)\nThere is a lot to love about the Samsung Odyssey G6 (8/10, WIRED Recommends), from its gorgeous OLED panel to its highly accurate DCI-P3 color coverage. But the one feature that stood out to me when I reviewed it was the absolutely ludicrous 360Hz refresh rate. That is so many frames per second that it effectively ensures your monitor will never be the bottleneck on the road to smooth gameplay. —Eric Ravenscraft\nElgato Stream Deck MK.2 for $123 ($37 off)\nPopular with Twitch streamers, this translucent purple deck offers a console of 15 buttons you can program to get things done. We have Elgato Stream Deck tips if you need ideas about what and how to automate. The faceplate is swappable and there is a detachable stand. Also on sale, the Elgato Stream Deck Plus ($170) switches some buttons for dials. Both are at all-time lows. —Simon Hill\n\nJump to a topic: Best Amazon Device Deals, Best Tech Deals, Best Home Deals, Best Kitchen Deals, Best Coffee Deals, Best Apple Deals, Best Smartwatch Deals, Best TV Deals, Best Laptop and Tablet Deals, Best Soundbar Deals, Best Headphone Deals, Best Speaker Deals, Best Gaming Deals, Best Charging Deals, Best Outdoor Deals, Best Camera Deals\n\nUGreen Nexode Power Bank for $40 ($10 off)\nWith an irresistible cute wee robot face that doubles as a display for charging stats, this is one of our favorite power banks. It is also a zippy performer with a USB-C port that can deliver up to 100 watts and boasts support for just about every fast charging protocol under the sun. There is also a USB-A that is good for up to 15 watts. The 12,00 mAh capacity is enough to charge most phones at least twice. —Simon Hill\n\nJump to a topic: Best Amazon Device Deals, Best Tech Deals, Best Home Deals, Best Kitchen Deals, Best Coffee Deals, Best Apple Deals, Best Smartwatch Deals, Best TV Deals, Best Laptop and Tablet Deals, Best Soundbar Deals, Best Headphone Deals, Best Speaker Deals, Best Gaming Deals, Best Charging Deals, Best Outdoor Deals, Best Camera Deals\n\nNinja Woodfire Outdoor Pizza for $300 ($100 off)\nI freaking love this humble little electric pizza oven, which has zero pretensions but is one of the most versatile additions to my outdoor kitchen. The woodfire in the name is a bit of a stretch, given that it just has a tiny trapdoor with which to add pellets to give a smoky flavor to your food. But it is so easy to use that over the past year, I have ended up using it every day. Just punch in what style of pizza you want, let it preheat, and pop it in. I have also used it to make muffins, ribs, and macaroni and cheese. —Adrienne So\nSegway Ninebot E2 Plus Electric Scooter for $285 ($135 off)\nThe E2 Plus is a 32-pound electric scooter with a range of roughly 10 miles. (I tested it as a 6'4 man—most people will be able to go a little farther.) It is easy to fold up and carry around, and the 15-mph top speed is beginner-friendly. Do not expect it to go up steep hills with the 300-watt motor, but it is a great affordable scooter for grocery runs or quick trips to the deli. —Julian Chokkattu\n\nJump to a topic: Best Amazon Device Deals, Best Tech Deals, Best Home Deals, Best Kitchen Deals, Best Coffee Deals, Best Apple Deals, Best Smartwatch Deals, Best TV Deals, Best Laptop and Tablet Deals, Best Soundbar Deals, Best Headphone Deals, Best Speaker Deals, Best Gaming Deals, Best Charging Deals, Best Outdoor Deals, Best Camera Deals\n\nSony Alpha 7R V Full-Frame Mirrorless for $3,498 ($400 off)\nOur top pick for max megapixels, Sony is flagship full-frame mirrorless camera features a 61-megapixel full-frame sensor, which is largely unmatched in its class (if you want more megapixels you will need to get a medium-format camera). If that is not enough, there is a 16-shot, high-resolution mode that can create 240-MP images (so long as your subject is static, e.g., a landscape). The dynamic range is outstanding and the autofocus is plenty snappy. —Scott Gilbertson\nSony Alpha 7 IV Full-frame Mirrorless Camera for $2,298 ($200 off)\nWe think this is the best mirrorless camera for most people. Sony is A7 IV (9/10, WIRED Recommends) is a 33-megapixel, full-frame camera capable of incredibly sharp images, with excellent dynamic range and the best autofocus system on the market. It is compact and light enough to carry all day without back strain, and the grip is comfortable. The five-axis image stabilization means you can hand-hold it in lower light, and the wide range of 4K video options makes it the best all-around video-and-stills combo on the market. —Scott Gilbertson\nGoPro Hero 12 Black Action Camera Bundle for $300 ($150 off)\nThe new Hero 13 Black brings interchangeable lenses and other features, but last year is Hero 12 Black (8/10, WIRED Recommends) is still a great camera, especially at this price. It is our favorite GoPro on sale, and on sale it is. For $300 you would be hard-pressed to get a better action camera. There is good, smart stabilization, support for Log video, wireless mic support, and a tripod mount. The one downside is there is no GPS support in the Hero 12 (that is good for battery life, but if you liked GPS, this is not the camera to get). —Scott Gilbertson\n\nFujifilm Instax Square SQ40 Instant Camera for $139 ($11 off)\nThis is not a huge deal, but we rarely see Fujifilm is nicer Instax cameras go on sale. We think this is the best camera that uses the square Instax film. The SQ40 is about as simple as it gets, twist the lens barrel to turn it on, frame your shot, hit the shutter button, and voilà out comes your image, which develops in about 90 seconds. There is a film counter near the bottom left side of the back to let you know how many images you have left. The only other option is a selfie mode, designed for close-ups.\n\nJump to a topic: Best Amazon Device Deals, Best Tech Deals, Best Home Deals, Best Kitchen Deals, Best Coffee Deals, Best Apple Deals, Best Smartwatch Deals, Best TV Deals, Best Laptop and Tablet Deals, Best Soundbar Deals, Best Headphone Deals, Best Speaker Deals, Best Gaming Deals, Best Charging Deals, Best Outdoor Deals, Best Camera Deals\n\nAmazon is big sale event runs from Tuesday, October 8, through Wednesday, October 9, 2024. It ends at 2:59 am ET on October 9 (11:59 pm PT).\nWill You Need a Prime Membership?\nYes, this event is for Amazon Prime members, meaning most of these Prime Day deals are for subscribers only. If you want to take the ride you need to buy the ticket. In this case, the ticket is $15 a month, and you get free two-day shipping. There are a whole bunch of other Prime Day perks you can take advantage of as well. You can also sign up for a 30-day Amazon Prime trial. Just register before the event and cancel right when the trial ends so you can take advantage of these deals. That said, there are a lot of discounted products available to folks who are not Prime subscribers. Retailers like Best Buy and Walmart are also price-matching some items or throwing their own competing sales.\nWhat Are Invite-Only Deals?\nLast year Amazon introduced invite-only deals—a system to help make it easier for Prime members to access deals that are expected to sell out quickly—and the company has brought it back for Prime Big Deal Days. The feature is only available for select products but it has spread across a variety of categories and price points.\nIf a specific product is part of the Invite-Only Deals system, you will see a Request Invite button on the right-hand side. All you have to do is click it for a chance to buy the product at that sale price. However, it is important to note that there is no guarantee you will receive the invite. You can learn more about the program and how it works in our story on How to Shop Like a Pro During Amazon Prime Day. The Best Amazon Prime Day Portable Charger and Power Station Deals Amazon Prime Perks"
    },
    {
        "title": "At -45% on Amazon Prime Day, This LG C4 Series TV Will Sell Like Hotcakes",
        "description": "Amazon surprises us with this unprecedented offer.",
        "url": "https://gizmodo.com/at-45-on-amazon-prime-day-this-lg-c4-series-tv-will-sell-like-hotcakes-2000508799",
        "publishedAt": "2024-10-08T12:10:27Z",
        "content": " Today is the first day of Prime Day at Amazon, and you can enjoy a stunning deal on LG is OLED evo C4 Series 4K TVs. The current deal offers a massive discount across multiple screen sizes and what is exciting is that it is accessible to all customers, not just Prime members. With this level of accessibility, these TVs are likely to sell out at lightning speed, so quick make sure you snag this deal before it runs out of stock. See 65″ LG TV at Amazon See 55″ LG TV at Amazon"
    },
    {
        "title": "25 Best Amazon Prime Day Hair Tool Deals to Shop Right Now (2024)",
        "description": "Some of the hottest styling gadgets are on sale for Prime Big Deal Days—these are the WIRED Gear team’s favorites. Shop the best Prime Day hair tool deals!",
        "url": "https://www.wired.com/story/best-prime-day-hair-tool-deals-october-2024-1/",
        "publishedAt": "2024-10-09T14:25:43Z",
        "content": " Each tool listed here has been vetted for our Best Hair Straighteners, Best Hair Dryers, and Best Curling Irons guides and deemed worthy of purchase by our Gear team of testers, as well as tracked over the previous weeks to ensure the sale is a legitimate one. However, be aware you do need an Amazon Prime membership to take advantage of these deals—for more information on whether it is worth it for you or not, check out our primer on membership perks.\nWIRED Featured Deals\n\nOur favorite straightener: Paul Mitchell Express Ion Style+ Ceramic Flat Iron for $99 ($32 off)\nA multi-tool that can do it all: Dyson Airwrap for $500 ($200 off)\nThe blow-dry brush for those in a hurry: T3 AireBrush Round for $105 ($45 off)\nA versatile curling iron: T3 Switch Kit Curl Trio for $210 ($90 off)\n\nPower up with unlimited access to WIRED. Get best-in-class reporting that is too important to ignore for just $2.50 $1 per month for 1 year. Includes unlimited digital access and exclusive subscriber-only content. Subscribe Today.\nHair Straightener Deals\n\nSutra IR2 Straightening Iron for $140 ($35 off)\nAs I describe in our Best Hair Straighteners guide, this is one of the only flat irons I have ever tried that can straighten my difficult curls in a single pass and keep them that way. The titanium plates—which heat up in around 23 seconds to 450 degrees Fahrenheit—feature a small inlaid infrared strip, which Sutra says helps to seal the hair cuticle. This is the first time I have seen this iron on sale, so it is a great buy if you have thick, unruly hair like I do and are ready for an iron that can take care of business in just a pass or two. Just make sure you also pick up a heat protectant if you do not already have one—we recommend Curlsmith Miracle Shield.\nShark FlexStyle Drying & Styling System for $235 ($65 off)\nIf you have straight or wavy hair and already know a blow-dryer brush works for your texture, Shark is FlexStyle is a worthy upgrade that combines a hair dryer, two brushes, and two auto-wrap hair curlers in one—designed to cut a significant amount of time and storage space. It may seem pricey, but as our Gear Team testers mention in our Best Hair Straighteners guide, this is basically a perfect dupe of the enduringly popular Dyson Airwap multi-styler (see below), which is twice the price—making the highly rated FlexStyle an even better deal at its sale price of $235.\nTymo Airflow for $55 ($25 off)\nThe Tymo Airflow is a great hair straightener that can double as a curler, too, thanks to the rounded barrel. I like a smooth undercurl when I straighten my hair, and the Tymo Airflow is perfect to achieve that for me. I have especially loved using it with short hair, but it worked well for my long hair too. The heat settings range from 284 degrees to 428 degrees Fahrenheit, and Tymo includes a little guide on which heat setting to use based on your hair type. While it looks more like a curler, it performs best as a straightener. It did give my hair some soft curls when I used it curling-iron style, though. —Nena Farrell\nT3 SinglePass Smooth X for $105 ($45 off)\nOne of the better Prime Day hair deals, this icy-pink straightener not only looks stylish, its plates are longer (4½ inches, compared with the 4 inches on most irons) but still narrow at 1 inch, allowing for more surface area without sacrificing maneuverability. Nine heat settings with an internal microchip to control fluctuations and a special finish to add shine round out the features. I did not have a ton of success using this on my curls, but my mom has fine waves and this is her favorite flat iron.\nT3 SinglePass StyleMax for $105 ($45 off)\nThe StyleMax has a number of factors that are similar to its sibling above, like the same rose-gold accents and proprietary CeraGloss plates. It does have a much wider range of temperature control options, which is great if you have fine or delicate hair and are especially worried about damage. Just be sure to keep the manual so you can make sure you know what, er, all of the lights mean.—Adrienne So\nPaul Mitchell Pro Tools Express Ion Style+ Ceramic Flat Iron for $99 ($32 off)\nMy favorite flat iron for touch-ups, this was the top overall pick in our Best Hair Straighteners guide. The 1-inch ceramic plates top out at 410 degrees Fahrenheit, and the compact body is easy to maneuver in the event you want to add some waves. If you want a higher-end straightener but are put off by the idea of spending upwards of $150, this is both a great iron and a great deal at under $100.\nChi Original Ceramic Flat Iron for $55 ($15 off)\nThis Chi is not only a perpetual Amazon bestseller, it is beloved by both former WIRED contributor Victoria Woollaston-Webber and myself. I had one for more than a decade, and it somehow still made short work of my 3a curls, despite its max temperature being only 392 degrees Fahrenheit. If you have been working with $20 drugstore models, as I myself did during much of my twenties, this is a worthy investment and excellent entry into the world of more upscale hair straighteners.\nDyson Airstrait for $450 ($50 off)—Click the Coupon Button\nI have been using Dyson is Airstrait (8/10, WIRED Recommends) exclusively on my hair for over a year now. It has the same form factor as a standard flat iron, but it uses airflow to dry and straighten your hair simultaneously instead of hot plates. You can also pick between two main styling modes (wet and dry) as well as three temperature settings. Whenever I wash my hair, I will set it to wet mode to fully dry it and then switch to dry mode to flatten out any puffiness. It is allowed me to cut my full hair routine from 45 minutes to 15 minutes. —Brenda Stolyar\nT3 Smooth ID Straightener for $223 ($27 off)\nThis straightener is expensive, but it is a great option if you are worried about hair damage. It comes with a proprietary temperature-finding feature called HeatID Technology. On the iron is handle, you can select your hair features, length, and whether your hair is color-treated. It will then suggest the appropriate heat level to straighten your hair. We also love the Refresh mode feature, which touches up your hair at a lower temperature based on previous settings. —Brenda Stolyar\nRevlon Double Straight Dual Plate Hair Straightener for $28 ($30 off)\nThe Double Straight is a bit unique since it has a four-plate design. The first two plates straighten your hair, while the second two reinforce the style. This allows you to make two passes simultaneously, which reduces the time it takes to style your hair and the risk of heat damage. It also comes with the most temperature settings of any straighteners we have tested—you will have 10 to choose from, ranging from 85 degrees Fahrenheit (140 Celsius) up to 455 degrees Fahrenheit (235 Celsius). —Brenda Stolyar\nHair Dryer Deals\n\nDreame Pocket High-Speed Hair Dryer for $100 ($60 off)—Click the Coupon Button\nFormer WIRED reviewer Medea Giordano was quite impressed by this dryer, which is more powerful than it looks and folds up small enough to fit in a purse. Though she did not love using it on her curly hair, as she points out in our guide to Best Hair Dryers, she still thought it was perfect for those with straight or wavy hair, or as a travel dryer.\nTymo Hair Dryer With Diffuser for Curly Hair for $130 ($60 off)\nAs featured in our guide to Best Hair Dryers, this compact dryer features accessories that magnetically attach to the dryer body, including a comb and a diffuser for styling curly hair, plus a handy digital display on the back that shows the exact temperature. In fact, the only downside our tester could find was the price, so this is a great grab at $60 off.\nBed Head Curls-in-Check Hair Diffuser Dryer for $24 ($4 off)\nEven though former WIRED reviewer Medea Giordano points out (not incorrectly) that everything about the Bed Head brand screams '90s, she liked this purple-and-neon-yellow hair dryer for its ability to dry her curls without disrupting their pattern. She also liked that it was lightweight with an unusually large 4-inch-wide mouth. Granted, $4 off is not exactly a groundbreaking sale, but if you are looking for an inexpensive hair dryer specifically for curls, this is a decent option.\nT3 AireLuxe Hair Dryer for $140 ($60 off)\nT3 is a popular brand in the hair tool space for good reason, and this white-and-rose gold ionic hairdryer was one of our top picks in our Best Hair Dryers guide. The Gear team testers loved how it felt lightweight and effortless to use, and the fact that it comes with its own flat and round brushes for styling makes this an even more impressive deal than it already is.\nT3 Featherweight StyleMax Hair Dryer for $123 ($77 off)\nT3 is Featherweight StyleMax really is lightweight—my arms do not ache as I dry my hair with this one. It is made of plastic to keep it lightweight, but it does not feel cheap or flimsy. It also comes with a nice set of attachments, including a diffuser that I love using, plus two concentrators and a smoothing comb. It is a great blow dryer if you alternate between diffusing your hair and doing a classic blowout. —Nena Farrell\nBellissima Italia Diffon Hair Dryer for $135 ($34 off)\nMany people with curly hair are familiar with diffusers that attach to hair dryers, but they may not have seen a hair dryer that itself is actually shaped like a diffuser—this unique tool combines them both in one trendy-looking gold package. Despite the Diffon is having no handle, former WIRED reviewer Medea Giordano describes it as being comfortable to use, and in our Best Hair Dryers guide, she said it styled her curls well without adding frizz or puffiness. The gentle airflow settings may take some extra time to dry thick or voluminous hair, as was the case for Medea, but this could be an excellent solution for those with thinner or finer hair, especially if it is on sale.\nDryBar Buttercup for $99 ($100 off)\nThis is one of our favorite hair dryers for reducing frizz. It comes with two air concentrator nozzles that help distribute heat and airflow, so it does not overdry the hair. Instead, the attachments help to create a shiny and smooth look. The hottest heat setting does not feel like it is burning your scalp either. —Brenda Stolyar\nCurling Iron Deals\nT3 Switch Kit Curl Trio for $210 ($90 off)\nWe love this curling iron for its versatility. In addition to the styler handle, it comes with three attachments, including a 0.5-inch barrel for tight, defined curls; a 1.25-inch barrel for soft, natural curls; and a 1.5-inch barrel for larger curls and waves (which comes with a clip to help keep hair in place). Although you can pick a specific temperature, it does come with nine different heat settings that range from 260° to 410° Fahrenheit. It is a great option for a variety of hair types and is super easy to use.—Brenda Stolyar\nRemington Shine Therapy Curling Wand for $24 ($6 off)\nAs our tester notes in our guide to Best Curling Irons, this budget iron is infused with argan oil and keratin for extra shine. We also appreciated the inclusion of a heat glove, as well as a tapered barrel, 10 heat settings with a digital display, and longer handle for added maneuverability. It comes in three sizes, but for larger, looser curls and waves, our tester recommends the 1-1.5 inch size.—Brenda Stolyar\nGHD Curve Classic Curling Iron for $157 ($52 off)\nWe recommend this one for long-lasting curls. With a 1-inch ceramic barrel, it is small enough for short hairstyles but large enough for creating curls in longer, thicker hair. The clamp and easy-to-use handle also keep the hair in place as you twist it and the cool tip is larger than other curlers we have tried. It is tapered too, which helps you know how close you are to the hot metal barrel while creating curls—if your fingers are on the thin end, you are further away; grabbing the thicker end means you have a higher risk of accidentally burning yourself.—Brenda Stolyar\nDyson Airwrap for $500 ($200 off)\nThe Dyson Airwrap (8/10, WIRED Recommends) is the multi-tool that can do it all—a simple wand that comes with six attachments ranging from different-sized curling barrels to brushes. It creates a vortex of air (called the Coanda effect) to draw hair to the wand for effortless drying, smoothing, and curling. Our reviewer loved how it cut down the time she spent on her styling routine. Though the Airwrap is notoriously expensive, this is a legitimate sale, so if you have been on the fence, this might be a good time to try it out.—Brenda Stolyar\nOther Tools\n\nTymo Ring for $40 ($20 off)\nFormer WIRED reviewer Medea Giordano likens this trendy 2-in-1 styling tool to a combination hot comb and straightening iron, saying the idea is for users to be able to get closer to their roots without burning themselves than they otherwise would with a classic hot comb. It may not be the best option for those with super-curly hair, as Medea still had to use a flat iron afterward, but people with easier-to-straighten hair who are worried about the potential damage inflicted by traditional flat irons might do well to give this one a try while it is on sale.\nT3 AireBrush Round for $105 ($45 off)\nBlow-dry brushes have become my holy grail product since becoming the mom of a toddler. Whether my hair was long or short, I found myself grabbing a blow dry brush to help dry my hair and style it enough to resume wrangling my kiddo. My favorite so far is the T3 AireBrush Round, which has a 2.5-inch brush that is small enough for my short hair and can get it dry and styled in a matter of minutes. There are three different heat settings (I like the coolest setting for my fine hair) and two speed settings to use. It is a great brush I find myself grabbing on days I want a blowout. There is also an oval version that is on sale too if you prefer the hairbrush shape over the round. —Nena Farrell\nRevlon Volumizer Plus 2.0 for $37 ($33 off)\nFor those with easy-to-straighten hair who can create sleek styles with just a blow dryer, this budget blow-dry brush is recommended in our Best Hair Straighteners guide as a way to revive second-day hair. It is a classic round (well, oval in this case) brush with the hair dryer built right in—you can save a step in your blowout process for less than half the price of more popular models. If you have been wanting to try a blow-dry brush but are not ready to commit to shelling out for one of the trendier, more expensive models, this is the perfect chance to see if it is the tool for you.\nVoloom Classic 1-½ Inch Professional Volumizing Ceramic Hair Iron for $112 ($28 off)\nOn the scale of intimidating hair tools, this one admittedly ranks near the top. Clamping a giant waffle iron-looking contraption close to your scalp? Clips? Mysterious sizzling noises? However, if you want to add first-day volume back into second-, third-, or even fourth-day (do not judge) hair, this is the way to do it. Though Voloom insists throughout its literature that it is not a crimping iron, it does work in much the same way, just with a proprietary plate pattern designed to lift your hair off your scalp at the root. I am honestly not sure how I lived without this thing, but it is certainly not inexpensive at its full price—if you have been wanting to give it a try, today is your chance while it is still $28 off. Looking for some decent last minute Prime Day hair deals before Prime Day ends in a few hours? You have come to the right place. A good-quality hair tool can not only make short work of your morning routine, it is usually better for your hair, too. Unfortunately, some of the more popular high-end appliances can run anywhere from $100 up to almost $700, so events like Amazon Prime Day—happening for a second time in 2024 on October 8 and 9—are some of the best times of the year to grab one for yourself or for a gift. The Best Amazon Prime Day Portable Charger and Power Station Deals Amazon Prime Perks How to Shop Like a Pro During Amazon Prime Day"
    },
    {
        "title": "Keep Burglars at Bay: Ring Alarm 5-Piece Kit at 40% Off on Amazon Ahead of Prime Day",
        "description": "Amazon offers peace of mind for just over $100.",
        "url": "https://gizmodo.com/keep-burglars-at-bay-ring-alarm-5-piece-kit-at-40-off-on-amazon-ahead-of-prime-day-2000506187",
        "publishedAt": "2024-10-02T14:25:30Z",
        "content": " In a world where peace of mind comes at a premium, Amazon is Ring has swooped in with a deal that is sure to set off alarms—in a good way. The Ring Alarm 5-piece kit, a bestseller in its category, is available at a jaw-dropping price of $119 down from its original $199. This 40% discount is not just a fleeting Prime Day tease but it is an early bird special open to all, Prime members or not. See at Amazon Ring is an Amazon brand and it has carved out a reputation for offering some of the best value-for-money propositions in the smart home security market. Their devices strike a balance between affordability and functionality that few competitors can match. The intuitive setup process and user-friendly app make it accessible even to those who might be technologically challenged. With features like real-time notifications, the ability to arm and disarm remotely and optional professional monitoring, Ring puts the power of a full-fledged security system in the palm of your hand."
    },
    {
        "title": "Price error or not, these AirTags are a steal this Prime Day on Amazon",
        "description": "Amazon spares no Apple product, not even the AirTags.",
        "url": "https://gizmodo.com/price-error-or-not-these-airtags-are-a-steal-this-prime-day-on-amazon-2000508426",
        "publishedAt": "2024-10-07T17:28:19Z",
        "content": " As Prime Day reaches its final hours this Wednesday, Amazon is offering a great deal on Apple AirTags that you will not want to miss. These popular tracking devices are now available at prices that make them an absolute steal but time is running out to take advantage of this offer. Single AirTags are currently priced at just $24, down from their regular $29. See AirTag for $24 at Amazon See 4-Pack of AirTags for $79 at Amazon With these rock-bottom prices, AirTags are selling fast on Amazon. The four-pack has already climbed into the top 5 best-selling electronics during Prime Day. This surge in popularity, combined with the significant discounts, means that stock is likely to deplete rapidly. If you have been considering purchasing AirTags, now is the time to act."
    },
    {
        "title": "A New RoboCop Series Is Marching Ahead at Amazon",
        "description": "A show based on the 1987 Paul Verhoeven cult classic just got a new showrunner.",
        "url": "https://gizmodo.com/robocop-amazon-series-showrunner-james-wan-2000503460",
        "publishedAt": "2024-09-25T20:50:01Z",
        "content": " Amazon just took a big step forward on a show that will cost significantly more than a dollar. A new series based on Paul Verhoeven is 1987 classic RoboCop has been in the works for about a year and now the streamer has set Peter Ocko (Lodge 49, Moonhaven) as its showrunner—and none other than James Wan as one of the executive producers. Last year, RoboCop was at the top of a list of properties Amazon wanted to resurrect after its acquisition of MGM. It is unclear exactly what direction the show will take, or how it will be different from other iterations, but with Ocko is experience (he is also worked on The Leftovers, The Office, Elementary, Black Sails, and Pushing Daisies) and the vision of Wan is company, Atomic Monster, you have a sense it will be tonally or thematically along the lines of that original film. Plus, this is Amazon. A company that spends about a gazillion dollars on Lord of the Rings. RoboCop is not quite Lord of the Rings in terms of name recognition but it is well-known enough that you would assume it will get a significant investment. Also, if the show is half as subversive, interesting, and fun as the original movie, it could be very intriguing."
    },
    {
        "title": "The Amazon Echo Show 8 Can Be Your Very Own Sous Chef for 30% off",
        "description": "Save 30% on the third generation smart home hub from Amazon and revolutionize your home experience.",
        "url": "https://gizmodo.com/the-amazon-echo-show-8-can-be-your-very-own-sous-chef-for-30-off-2000501332",
        "publishedAt": "2024-09-20T15:19:28Z",
        "content": " The Alexa-enabled smart home hub with the HD display is down 30% for Amazon early prime big deal days. That is right, the Echo Show 8 is part of a limited time deal, bringing the price down from $150 to just $105. This is the third generation and 2023 release of the smart home from Amazon. There is a lot of great uses for this, but in my mind there is one place in your home specifically you should be considering for where to put this puppy. See at Amazon Being an Amazon streaming device, you will be able to connect to Prime Video, Netflix, Hulu, and all your other favorite streaming apps. For music listening, you can set the default to either Amazon Music, Spotify, or Apple Music so Alexa knows where to pull the song from when you ask her to play Pink Pony Club by Chappell Roan one more time."
    }
]