[
    {
        "title": "The next iPhone SE may lose the home button, add Face ID and Apple Intelligence",
        "description": "Apple is rumored to be readying the next iPhone SE, complete with Face ID and Apple Intelligence, for manufacturing ahead of a release early next year.",
        "url": "https://www.theverge.com/2024/10/1/24259713/iphone-se-face-id-apple-intelligence-no-home-button",
        "publishedAt": "2024-10-01T21:01:28Z",
        "content": " An iPhone SE that feels very much like any other modern, non-budget iPhone is apparently coming early next year, according to Bloomberg is Mark Gurman. The phone will use Face ID and will be capable of running Apple Intelligence, he reiterated today.\n\nThat the new iPhone SE models may support Apple Intelligence says a lot about their performance — it takes a lot of RAM to run local AI features, for instance. They are expected to look like the iPhone 14, doing away with the chunky top and bottom bezels and the home button; both are firsts for the entry-level smartphone. It is also rumored that the iPhone SE 4 will get an OLED screen, rather than the usual LCD.\n\nApple will produce 11-inch and 13-inch iPad Airs with internal improvements at the same time as the new SE models, Gurman writes. And right along with those will be new Magic Keyboards for both sizes that will come with some iPad Pro keyboard features. \n\nFinally, according to Gurman, before the year is through, Apple will release new M4-equipped computers: a smaller Mac Mini, new MacBook Pros, and iMacs. He reckons an update to the iPad Mini is also possible.\n"
    },
    {
        "title": "Apple iPhone 16 Pro and iPhone 16 Pro Max Review: Smarter iPhones",
        "description": "Apple Intelligence might be overhyped, but it brings some helpful capabilities to the iPhone.",
        "url": "https://www.wired.com/review/apple-iphone-16-pro-and-iphone-16-pro-max/",
        "publishedAt": "2024-09-18T12:00:00Z",
        "content": " The iPhone 16 has been one of the weirder smartphone launches I have seen from Apple in the nine years I have been covering tech. Much of the product is new capabilities are wrapped around Apple Intelligence—a suite of smart features powered by artificial intelligence—which is not available at launch. Apple will roll out a software update in October to deliver these promised perks. But my entire testing period with the iPhone 16 Pro and iPhone 16 Pro Max has been on a developer beta of iOS 18.1, which has many (not all) of these Apple Intelligence features already running. I feel like I have a good handle on what the experience will be like for iPhone owners in October, though this early version of the software also had a few bugs. While doing some performance testing, for example, Resident Evil Village crashed a few times no matter whether I had maxed out the graphics settings or not. Apple could not replicate the issue but suggested I roll back to the stable version of iOS 18 to fix the problem. Broadly, there are some nice improvements with the iPhone 16 Pro and iPhone 16 Pro Max. They deliver some of the best performance on a phone, have solid battery life, and have excellent camera systems. When you throw in Apple Intelligence, there are moments when the new capabilities are helpful day to day, but there is no must-have software perk (yet) that makes Apple is AI features leaps ahead of the smartphone pack, nor worthy of an upgrade alone. In some ways, Apple Intelligence makes it feel like the company is playing catch-up. Take smart replies as an example. This is one of the new AI features in Apple is Mail client and the Messages app. If someone messages you, you will get a prompt above the keyboard to send a reply generated based on the context of the conversation. Siri is a big part of the Apple Intelligence package. Now, when you activate the voice assistant, there is a lovely glow around the entire screen. You can even keep using your phone after triggering Siri so asking a question does not have to interrupt what you are doing. If you make a mistake in your question or change your mind mid-sentence, Siri can still decipher what you are asking and answer. Apple iPhone 16 Pro and iPhone 16 Pro Max Creating summaries seems to be a thing everyone wants to do with AI, and Apple Intelligence is ready to do the same. You can have your emails summarized, messages summarized, and even your notifications from third-party apps summarized. Some of this can be handy, like when the Mail app calls out an urgent-sounding email in its summary, which I would have missed had I just glanced at the giant collection of emails. But more often than not I just swipe away the summary and dive into all the notifications. Arguably the most helpful Apple Intelligence features for me as a journalist who attends multiple briefings a month are the new transcription tools in the Notes, Voice Memos app, and even in the Phone app. Hit record in Voice Memos and Notes and the apps will transcribe conversations in real time! If you are on a phone call, tap the record button and after both parties are notified, it will start recording the call, and you will get a transcription saved to your Notes app. The Photos app is getting an Apple Intelligence infusion too, and the highlight here is the Clean Up feature. Just like with Google is Pixel phones that debuted Magic Eraser more than three years ago, you can now delete unwanted objects in the background of your iPhone photos. This works pretty well in my experience, though I am a little surprised Apple gives you so much freedom to erase anything. I completely erased my eye from existence in a selfie. I erased all my fingers off my hand. (Google is feature does not let you erase parts of a person is face.) There is more to come in Apple Intelligence. Image Playground will let you generate images. Genmoji will let you create new kinds of emoji that right now only exist in your mind. Siri will be able to better serve more contextually relevant information. But I will have to do another dive into Apple Intelligence when those features arrive later this year. Just a reminder that Apple Intelligence is a part of the next iOS 18 update, but it is only available on select devices: the iPhone 15 Pro, 15 Pro Max, and the entire iPhone 16 range. Also, the key part of Apple Intelligence is that the company is deploying these features in a way that is arguably more private and secure than anything that has come before, though security researchers are still evaluating the efficacy of Apple is Private Cloud Compute technology. (You can read more about this proprietary process here.) So if it seems like Apple is late to the game on some of these features, that is the company is M.O., taking its time in delivering a better and usually more secure experience. Oh right, there is a new phone too! I am not going to go over all the specs and such—I have a lot of that information here—but let is touch on what the new changes are like. First, I would like to ask Apple to please start giving its Pro phones more fun colors. It is silly that the iPhone 16 Pro is relegated to more neutral color palettes like Desert, and there is no way to get it in pink or ultramarine like the iPhone 16 and iPhone 16 Plus. (You can always try a fancy case!) At least you can wirelessly charge these phones faster—about 50 percent in 30 minutes with a MagSafe Charger paired with a 30-watt charger. (Side note: The 30-watt iPhone charger Apple sells separately is still comically large to what you can get on the market.) However, I do not particularly care for the sliding gestures on the Camera Control button. A light double-press (where you do not actually push the button down), will trigger an overlay menu that lets you slide your finger left or right on the button to cycle through camera modes. A light single press selects one, and you can slide through things like zoom levels or different Photographic Styles (Apple is color-grading filters). I find it much faster to make the change on the screen rather than sliding my finger precariously on this button. I may get more used to this after a while, but right now, I just like having a dedicated shutter button. (Pro tip: It is also much better for taking selfies with the rear cameras.) Apple has zhuzhed up its Photographic Styles, which are not like filters on Instagram. These can much more granularly adjust the colors in an image, whereas a filter just rests on top of your photo. You can shoot in a specific style (I love the Gold one), or change styles after the fact. There is a lot more customization here and what stands out is Apple is method of letting you change your skin tone. Unlike Google is Real Tone image processing technique trained on various skin tones to then produce more accurate results, Apple lets you adjust your skin tone to various other Undertones. I understand the reasoning here because sometimes you may want your skin tone to look a particular way in specific lighting. That said, in an apples-to-Apples comparison, I did find the Pixel 9 Pro is reproduction of my skin tone more accurate right off the bat, but the iPhone gave me more tools to tweak it to my liking. I am not sure how many times I would be hopping into the photo is editing settings to change it though. The Apple Intelligence capabilities are promising, even if some of it feels like Apple playing catch-up. The marketing sure feels overhyped. But the rest of the iPhone 16 Pro is hardware is polished and powerful too. (More buttons!) I only wish Apple would copy more of Google is call screening features because one thing is for sure: since I switched to these iPhones from the Pixel 9 series I recently reviewed, the spam calls will not stop."
    },
    {
        "title": "Apple’s New Passwords App May Solve Your Login Nightmares",
        "description": "Apple is launching its first stand-alone password manager app in iOS 18. Here’s what you need to know.",
        "url": "https://www.wired.com/story/apple-password-app-ios-18/",
        "publishedAt": "2024-09-16T15:52:52Z",
        "content": " After years of being told you should create unique, strong passwords for every website and app you use, you probably fall into one of two camps: people that are fully signed up to the password manager life, or those still using 123456 for every other website.\nApple is new encrypted Passwords app is automatically included with iOS 18, and is a public-facing evolution of its Keychain and password-saving capabilities. The Keychain, which has existed for more than a decade, no longer has as prominent a home in the iPhone is settings, and details previously saved there are being moved to the new app.\nThe launch of the password manager app, which will also be available on macOS Sequoia and iPadOS 18, may help improve people is relationships with their passwords but also could, to varying degrees, challenge existing password managers.\nThis move makes the app more visible to lay users and informs them about this secure method to store and manage passwords, says Talal Haj Bakry and Tommy Mysk from security company Mysk. You have a default password manager preinstalled on your device [that] provides end-to-end encryption when syncing data across devices.\nNew Passwords\nThe Passwords app has a pretty barebones design. Six different tiles are presented when you open the app on an iPhone: All, Passkeys, Codes, Wi-Fi, Security, and Deleted. These are essentially the main functions of the app, allowing you to save each type of data within their relevant sections. The security section includes check-ups allowing weak and exposed passwords to be identified.\nThis will definitely boost the adoption of this preinstalled app and bolster user security, Bakry and Mysk say. They add that it presents the saved data in a more organized way than the Settings app.\nApple says the Passwords app uses end-to-end encryption to save your details, meaning nobody, not even Apple, knows what you have saved. Within the app, you can search for login details to your entries and set up groups to share passwords with other people.\nYour saved login details are synced across Apple devices using iCloud, meaning the encrypted data is shared with Apple is cloud servers and available on all of your Apple devices. Within Apple is settings, you can turn off syncing passwords on a specific device. The app is locked using Face ID.\nWhen using the Passwords app, any details you have previously saved in Keychain or AutoFill will be moved to the new location. This includes if you have used the Sign in with Apple login system on any websites or apps. It is unclear why Apple has decided to spin its Keychain system into a fully fledged password manager now, although the company has been building out the individual features over a number of years. (Apple has not responded to WIRED is request for comment at the time of writing.)\nFor many people, having a standalone password manager app from Apple could encourage better password practices. Siamak Shahandashti, a senior lecturer in the University of York is cybersecurity and privacy research group, says the move from Apple may be a usability decision. Making Passwords visible could encourage people to take their passwords seriously.\nWe need to design authentication systems for human beings, Shahandashti says. We cannot expect users to maintain a hundred accounts, for each of them [to] use a strong password. It is actually the fault of the designers because these systems have not been designed for users considering the capability of an average human being.\nDeath of the Password\nPasswords are slowly dying. Enter the passkey. For the past couple of years, websites, apps, and phone manufacturers have been in the process of rolling out passkeys—a technology that replaces passwords, is more secure, and does not require you to remember any complex login details. (Although passkeys still have some teething problems.)\nLeona Lassak, a research assistant at Ruhr-University Bochum who has studied passkey adoption, says greater visibility of the Passwords app can help get the sign-in technology to a broader audience, one which might not use a password manager otherwise. Apple is Passwords app could help with the perception and transition to passkeys, Lassak says. There has been discussion about the need for passkey managers, because once we actually use them on websites, there is probably going to be multiple for each website, she says.\nThe app is also, at least subtly, encouraging the adoption of passkeys. Within Passwords' settings, accessed through Apple is System preferences, there is the option to turn on automatic passkey upgrades, which will allow existing accounts to use passkeys when they are available.\nLock In\nPassword managers have existed for years and there are plenty of options you can use, from open source apps to browser-based management systems. Each comes with their own particular set of pros and cons.\nApple wading into the password management market by including a new app on millions of iPhones, Macs, and iPads could also impact the wider ecosystem. There is no question that Apple is Passwords app would ‘sherlock' third-party password managers—or make them less attractive, say Bakry and Mysk, highlighting that people need to use iCloud to sync passwords in Apple is system, and that those who are privacy conscious may not want this to happen automatically.\nThere is also the risk of locking people into Apple is password manager—at launch, there appear to be no options to export the saved data and use it in a commercial alternative. One competitor password manager has stressed that their software works on products beyond the Apple ecosystem. (People using Apple is password management software on Windows devices can access saved details through iCloud for Windows.)\nUltimately, what password manager you use should reflect what type of software you want to support and the individual threats you may face. For many, Apple is new app is probably better than not using a password manager at all. Apple is latest iPhone software update, iOS 18, arrives today and includes a new app: Passwords. For the first time, Apple is taking your phone is ability to save login details and putting them in a standalone app. It could help improve millions of people is terrible passwords."
    },
    {
        "title": "Don’t buy at the Apple Store; Amazon is slashing prices on MacBook Pros for Prime Day",
        "description": "Apple hates discounts!",
        "url": "https://gizmodo.com/dont-buy-at-the-apple-store-amazon-is-slashing-prices-on-macbook-pros-for-prime-day-2000509179",
        "publishedAt": "2024-10-08T16:01:59Z",
        "content": " Amazon has kicked off Prime Day with a bang and unveiled incredible deals on the latest MacBook Pro models this Tuesday morning. Apple fans will be thrilled to discover that the 2023 MacBook Pro lineup featuring the cutting-edge M3 chip is now available at its lowest price ever. These are the exact same MacBook Pro models you would find in an Apple Store, complete with full manufacturer warranty. The only difference is Amazon is significantly reduced price and offers consumers a rare opportunity to own Apple is latest technology without the premium price tag. The MacBook Pro M3 models on offer at Prime Day are the most recent in Apple is lineup and feature the state-of-the-art M3 chip that delivers exceptional performance and energy efficiency. With its 14.2-inch Liquid Retina display, 8GB of unified memory and up to 22 hours of battery life, these laptops are true powerhouses suitable for both professional and personal use. As you can imagine, such significant discounts on Apple is latest products are quite unusual including during major shopping events like Prime Day and Black Friday. This could be Amazon is strategy to generate buzz leading up to Prime Day or to clear inventory: whatever the reason, it is an opportunity that potential buyers should not miss."
    },
    {
        "title": "The Best Alternatives to Apple AirPods",
        "description": "If you also found the latest AirPods 4 underwhelming, these are a few alternatives you could look into.",
        "url": "https://gizmodo.com/the-best-alternatives-to-apple-airpods-2000501952",
        "publishedAt": "2024-09-23T17:30:44Z",
        "content": " Last week, Apple released two new AirPods on the same day for the first time: the $180 AirPods 4 with ANC and $130 without it. Both feature an open-ear design as opposed to the in-ear tips found on the AirPods Pros. We were not big fans of the flagship AirPods due to their loose fit, average ANC against high-end sounds, and the absence of onboard volume controls so we compiled a small list of possible AirPods alternatives you can look into. Of course, there are not many options if you want to stay within the Apple ecosystem, but the Beats Fit Pro is a decent alternative providing some H-series chip functionalities. The ancient AirPods Max are ripe for a long overdue update but received none at the event. So, we have also mentioned our favorite over-ear headphones for ANC you can consider instead. These are the buds to go for if you are looking for AirPods alternatives but wish to stay within the Apple ecosystem. Apple-owned brand, Beats, features in the Beats Fit Pro the H1 chip, the chip found on the AirPods Max. The recent AirPods wireless earbuds models have all upgraded to H2, but you will still get some H-series functionalities like easy setup with your iPhone and seamless switching between Apple devices. These are a decent alternative to the $180 AirPods 4 because they sport a winged design offering a secure fit for workouts. Apple attempted to provide an alternative, non-mainstream fit with their recent AirPods lineup for folks whose ear canals reject in-ear tips. Unfortunately, the open-ear design was excessively loose and did not quite work. Pixel Buds 4 also feature ANC at their modest price which is not something you would find on the flagship AirPods' base model. For the same price, you are paying for a pair of buds lacking an essential function—mostly for the Apple tax. We have declared the Sony WH-100XM5s do ANC better than the AirPods Max. Plus, they retail for $350 compared to the eye-watering $500 price tag for Apple is over-ear headphones. Looking at the underwhelming updates the AirPods Max received at the Apple event—just a switch to Type-C charging and new color variants—Apple does not make a strong enough case to go for the Max."
    },
    {
        "title": "Apple put on notice over support for third-party watches and headphones",
        "description": "The European Union has opened new proceedings under the Digital Markets Act (DMA) that will see the bloc instruct how Apple can comply with its interoperability obligations",
        "url": "https://www.theverge.com/2024/9/20/24249738/eu-dma-apple-ios-iphone-interoperability-smartwatches-headphones",
        "publishedAt": "2024-09-20T10:57:06Z",
        "content": " The European Commission has opened new proceedings under the Digital Markets Act (DMA) that will see the bloc instruct Apple on how it can comply with its interoperability obligations. The two specification proceedings focused on iOS and iPadOS will conclude within six months. \n\nUnder DMA, Apple is required to provide third parties free and effective interoperability with hardware and software features controlled by iOS and iPadOS. Now the EU is going to help Apple understand what that specifically means.\n\nToday is the first time we use specification proceedings under the DMA to guide Apple towards effective compliance with its interoperability obligations through constructive dialogue, said outgoing EU competition chief Margrethe Vestager. We are focused on ensuring fair and open digital markets. Effective interoperability, for example with smartphones and their operating systems, plays an important role in this.\n\n[Media: \n\nThe first specification proceeding will examine how Apple is iOS operating system handles interoperability with devices like headphones, smartwatches, and virtual reality headsets, particularly regarding functions like notifications, device pairing, and connectivity. While the EU does not specify, we can imagine it might want to address AirPods' lack of support for true Bluetooth multipoint capabilities and a long-standing complaint from Garmin watch owners who can not send quick replies when paired with an iPhone. AirPods would seem out of scope, but we will see where the Commission draws the line.\n\nThe second proceeding will focus on how Apple is handling interoperability requests from third-party developers who want to bring their products to iOS and iPadOS devices. In a statement to Bloomberg, Apple said it is introduced secure ways for developers to request additional iPhone and iPad interoperability, and that undermining the system protections it is created would put European consumers at risk.\n\nThe Commission says it will communicate its preliminary findings to Apple, where it will explain the measures the gatekeeper should take to effectively comply with the interoperability obligation of the DMA. A summary of this will also be published for third parties to comment. If the iPhone maker then fails to comply, it eventually faces fines of up to 10 percent of its global annual turnover, but that is only after a lengthy non-compliance investigation.\n\nIn September last year, Apple was designated as a gatekeeper — large tech platforms providing essential services that could impact market competition — alongside Microsoft, Meta, Amazon, and Alphabet. \n\nCorrection, September 20th: Changed to say AirPods, not iPhones, lack true Bluetooth multipoint.\n"
    },
    {
        "title": "Apple iPhone 16 and iPhone 16 Plus Review: Why Go Pro?",
        "description": "With beefy batteries and the A18 chipset, these colorful iPhones have everything you need and not much you don't.",
        "url": "https://www.wired.com/review/apple-iphone-16-and-iphone-16-plus/",
        "publishedAt": "2024-09-23T17:27:00Z",
        "content": " The one overwhelming piece of feedback I have seen about the new iPhone 16 is that it looks pretty. The new teal, ultramarine, and pink colors are more vivid than previous ones, thanks to a new manufacturing process, which Apple says infuses color throughout the glass back of the phone. The iPhone 16 Pro colors are boring, and I agree. There are no sweeping changes to the iPhone 16 over its predecessor. Yes, there is a new Camera Control button, and the Action Button has trickled down from the Pro, but nearly every other part of the device is an iterative upgrade. I have also now been living with Apple Intelligence for a few weeks—at least, a beta version of it with some missing features—and it is safe to say that while there are a few features that will be very helpful day-to-day for some folks, it is not a reason to upgrade, especially if your iPhone is functioning fine. Apple spends a lot of time on prosumer features in its iPhone Pro models, but very few people will use them. ProRes? Log video recording? Academy Color Encoding System? If none of those words matter to you, then there are only a few reasons to get the iPhone 16 Pro this year. Apple iPhone 16 and iPhone 16 Plus Apple is more serious omission is the lack of ProMotion on the cheaper iPhones. This means you are stuck on a 60-Hz screen when almost every other smartphone at this price has a 120-Hz refresh rate. Maybe I am nitpicking, but the first thing I said after switching from the iPhone 16 Pro to the iPhone 16 was, Why is it laggy? It is not that the phone performs poorly. The display refreshes 60 times per second, and when you move from screens that refresh 120 times, you are effectively seeing slower animations throughout. This tech will likely get ported down in 2025, but it is past due at this price. The entire iPhone 16 lineup has Apple is new Ceramic Shield glass, which is supposedly twice as strong as the previous generation, but remember: Glass is still glass. I dropped the iPhone 16 Plus onto the pavement (a 4-foot drop), and the display cracked; business as usual. Get a case and screen protector! Build-wise, the Pro phones have a titanium frame versus aluminum on the standard iPhones, but durability-wise, they are all glass sandwiches. Titanium does make the Pro phones lighter, but the iPhone 16 and 16 Plus still weigh less. In recent years, Apple started giving the iPhone Pro models a significant chip upgrade to increase the performance gap between the phones, but this year they are all on the same starting point: the A18 chipset. The iPhone 16 Pro devices have the A18 Pro, which features larger CPU cache sizes and an extra graphics core for slightly better overall performance. That said, in my benchmark tests, the iPhone 16 and iPhone 16 Plus are just behind the Pros and still more powerful than any other phone on the market. I played AA games like Resident Evil and Assassin is Creed Mirage, though I did run into a few more stutters than on the Pro models (and just as many crashes, though this could have been because I was running a developer beta of iOS 18.1). I want to note that these games are currently the cream of the crop in graphical fidelity, so I am purposefully stress-testing. Most of the titles you will play will run perfectly. The Pro models this year have improved thermal performance, but Apple made some tweaks to improve the heat dissipation on the standard iPhones too, and I have not noticed the phones getting significantly hot. More importantly, every iPhone 16 model will be capable of running Apple Intelligence, the suite of artificial intelligence features coming in an update in October. I go over exactly what is included in Apple Intelligence in my iOS 18 guide, and have broadly evaluated the current experience in my iPhone 16 Pro review. There are some helpful day-to-day features, like real-time transcriptions in Voice Notes or call recordings, but we will have to wait until Apple brings the full kit. It is a shame Apple did not bring an updated spec for the charging port. When Apple switched to USB-C last year, it kept the same data transfer speeds for the iPhone 15—480 megabits per second. The Pro, on the other hand, has USB3 speeds of up to 20 gigabits per second. It is a massive difference (and an unnecessary one), but this only matters if you find yourself moving files from your iPhone to another device with a cord. I was surprised that Apple brought Audio Mix down to its cheaper iPhones. This feature lets you change the audio quality of your videos—Studio mode, for example, cuts out all background noise and makes you sound like you are in a studio; Cinematic mode, on the other hand, focuses on the people in the center of the frame and sprinkles in some background chatter as ambient noise. It is effective, and technically this works a bit better on the iPhone 16 Pro because it has better microphones, but again, the gap is not wide."
    },
    {
        "title": "2024 MacBook Air Heavily Discounted on Prime Day: How Could Apple Allow Amazon to Do This?",
        "description": "Apple must be pulling its hair out over this promotion.",
        "url": "https://gizmodo.com/2024-macbook-air-heavily-discounted-on-prime-day-how-could-apple-allow-amazon-to-do-this-2000509590",
        "publishedAt": "2024-10-09T11:35:49Z",
        "content": " As Amazon is Prime Day event reaches its final hours today, an unprecedented deal on Apple is latest MacBook Air (2024!) has taken center stage. This offer stands out not only for its substantial 23% discount but also because it is a rare opportunity to purchase a new Apple product at such a reduced price. What makes this deal particularly enticing is the 23% discount which brings the price down from $1,099 to just $849 for the 256GB model. This level of price reduction on such a recent Apple product is virtually unheard of and explains why it has become the best-selling computer during this Prime Day event. Apple is known for its steadfast pricing strategy and never offers any discounts on its products whether through its official website or retail stores. This makes the current Prime Day deal on the 2024 MacBook Air all the more remarkable. Amazon is leveraging its unique position in the market and managed to offer a discount that even Apple is most loyal customers find hard to resist. At the heart of this marvel is the M3 chip which a testament to Apple is silicon prowess. It is not just about raw power – this chip brings a new level of efficiency to the table. Pair that with a stunning 13.6-inch Liquid Retina display that can show off a billion colors, and you have got a visual feast for your eyes. For the on-the-go crowd, this MacBook is a dream come true. It is feather-light at under 2.7 pounds and whisper-thin at less than half an inch. And forget about battery anxiety – with up to 18 hours of juice, your charger can take a day off. Apple is forward-thinking shines through with features like Apple Intelligence and promise smarter interactions while keeping your privacy intact. They have also upped the ante on video calls with a good 1080p FaceTime HD camera and crystal-clear mics. As Prime Day winds down, this MacBook Air M3 deal stands out as a prime example of the event is appeal. It offers a rare chance to own one of Apple is latest and greatest at a price point that is typically reserved for older or refurbished models. For anyone in the market for a new laptop, particularly those invested in the Apple ecosystem, this deal presents an opportunity that is too good to pass up. With the clock ticking and stock potentially limited, interested buyers are advised to act quickly to avoid disappointment."
    },
    {
        "title": "Amazon Crushes iPad Prices by 40%, Hitting Apple Hard on Day Two of Prime Day",
        "description": "A 40% reduction on an Apple product is historic.",
        "url": "https://gizmodo.com/amazon-crushes-ipad-prices-by-40-hitting-apple-hard-on-day-two-of-prime-day-2000509556",
        "publishedAt": "2024-10-09T12:48:51Z",
        "content": " This Saturday, Amazon is offering a great deal on the 9th generation iPad (64GB, Wi-Fi model), slashing the price from $329 to just $199. This 40% discount marks the lowest price ever for this good Apple tablet and the record-low briefly seen during Prime Day sales earlier this week. But unlike Prime Day, this deal is available to everyone, not just Prime members. One of the most significant upgrades from its predecessor is the 12MP Ultra Wide front camera which supports Center Stage. This feature automatically pans and zooms to keep subjects centered in the frame during video calls and makes it ideal for remote work or online learning. The iPad 9 is compatible with the first-generation Apple Pencil and enhances its usability for digital art and note-taking. Its Smart Connector allows for easy attachment of keyboards and boosts productivity for tasks like writing emails or working on documents. This deal presents an rare and great opportunity for anyone in need of a reliable tablet to enter or upgrade within the Apple ecosystem at a fraction of the usual cost (40% is insane!). Deals of this magnitude on Apple products are exceedingly rare; Apple is known for maintaining strict control over its pricing and rarely offers discounts in its own stores."
    },
    {
        "title": "The New Apple AirPods 4 Are Already on Sale — Get Them for Early Prime Day Deal",
        "description": "Save up to 8% on the newly released Apple AirPods 4 for the first time!",
        "url": "https://gizmodo.com/the-new-apple-airpods-4-are-already-on-sale-get-them-for-early-prime-day-deal-2000502679",
        "publishedAt": "2024-09-24T16:15:01Z",
        "content": " Earlier this month, Apple announced a a handful of new products to the world. We saw a refresh in their smartwatches with the Apple Watch Series 10 and of course the latest iPhone with iPhone 16 and 16 Pro. And then lastly we had the newest model in the AirPods lineup — the Apple AirPods 4. Having only been announced to the world this September, the month we are currently in, it is pretty cool to see they already have them discounted. If you missed the pre-order window, that is cause for celebration. Right now, Amazon has them for up to 8% off. That is equates to a $10 discount, but hey. Ten dollars is ten dollars. Better to pay $169 on a new pair of AirPods with ANC than $179. The charging case now uses USB-C to be more convenient to the user. Apple is finally moving away from the Lightning port to align with the EU is new laws. This is great news as it means less types of cables to keep track of and more compatibility across other devices. The case is Apple is smallest yet. It an fit easily in your pocket or bag, but still has a robust battery life — holding up to 30 hours in total. Wireless charging is supported and a speaker has been added to help with the Find My app — a godsend for anyone who keeps forgetting what bag they last through them in. The Apple AirPods 4 are on sale over at Amazon, with both the ANC version and no-ANC version going for $10 off. Get them for $169 or $119, respectively."
    }
]