[
    {
        "title": "Microsoft is using AI to improve Windows search",
        "description": "Microsoft is improving its Windows search across File Explorer and Settings thanks to AI. A new Click to Do feature is also coming to Copilot Plus PCs.",
        "url": "https://www.theverge.com/2024/10/1/24258337/microsoft-windows-ai-features-click-to-do-super-resolution-photos",
        "publishedAt": "2024-10-01T14:00:00Z",
        "content": " Microsoft is using AI models to greatly improve Windows search on its new Copilot Plus PCs, including the addition of a new Click to Do feature that is very similar to Google is Circle to Search. These search improvements will make it easier to find and interact with images, emails, documents, and even videos and are just a few of the AI-based features coming to Copilot Plus PCs starting in November.\n\nThe improved Windows search will first show up in File Explorer on Copilot Plus PCs next month, allowing you to search for pictures using words, even if the search word is not found in the photo or file name.\n\nAI-powered search makes it dramatically easier to find virtually anything, says Yusuf Mehdi, executive vice president and consumer chief marketing officer at Microsoft. You no longer need to remember file names and document locations, nor even specific names of words. Windows will better understand your intent and match the right document, image, file, or email.\n\n[Image: Windows search improvements inside File Explorer. \n\nThis improved search will also be available in the coming months in the main Windows search interface and through the search box that appears in the Settings interface. You can type things like add my headphones into the Settings search box and it will help you find the right settings. \n\nSearch has not been great in Windows for years, so this AI-powered natural language search should greatly improve things — as long as it works as well as Microsoft promises. Microsoft is leveraging the NPU chips on new Copilot Plus PCs to enable local search on OneDrive content without having to be connected to the internet.\n\nAlongside Windows search, Microsoft will also start rolling out Click to Do on Copilot Plus PCs next month, which is very similar to Google is Circle to Search feature. With Click to Do, you hit the Windows key on a keyboard and left-click on a mouse to see an interactive overlay appear on your screen, which lets you select images or text to perform clickable actions. \n\nClick to Do works by first understanding everything you have seen on your screen and enabling useful shortcuts to actions to help you more quickly search, learn, edit, shop, or act on those items, explains Mehdi. It works on any windows, document, image, or even video.\n\n[Image: The new Click to Do feature. \n\nYou can use Click to Do on things like a YouTube video you are watching to do a visual search on an item that appears in the video using Bing. Click to Do is also context-aware, so it can help with text-related actions like rewriting or summarizing documents or explaining text and sending emails.\n\nMicrosoft will start testing these new search and Click to Do features with Windows Insiders on Copilot Plus PCs in October, followed by a gradual rollout in November. The previously announced Recall feature is also coming to testers in October on Qualcomm-powered devices, before being available to Windows Insiders on Intel- or AMD-powered Copilot Plus PCs in November. Microsoft says timing details on the broad availability of Recall will be shared soon.\n\nMicrosoft is also adding generative fill and erase to Microsoft Paint as part of these new Windows AI features. You can read more about the Paint and Photos AI additions right here.\n By  Tom Warren, a senior editor and author of Notepad, who has been covering all things Microsoft, PC, and tech for over 20 years. Sign up for Notepad by Tom Warren, a weekly newsletter uncovering the secrets and strategy behind Microsoft is era-defining bets on AI, gaming, and computing. Subscribe to get the latest straight to your inbox."
    },
    {
        "title": "Microsoft’s AI Boss Wants to Bring ‘Emotional Support’ to Windows and Office",
        "description": "Microsoft AI CEO Mustafa Suleyman is overseeing an overhaul that gives Copilot an empathetic voice, the ability to see, and more advanced reasoning skills.",
        "url": "https://www.wired.com/story/mustafa-suleyman-interview-microsoft-ai-ceo-copilot/",
        "publishedAt": "2024-10-01T14:00:00Z",
        "content": " As a cofounder of DeepMind, a British company acquired by Google in 2014, he helped devise a new way for computers to tackle seemingly impossible problems by combining practice with positive and negative feedback. DeepMind demonstrated the approach by developing a superhuman Go-playing program, AlphaGo, which defeated the world is best Go player in 2016.\nNow Suleyman is talking up a new kind of AI breakthrough.\nAs CEO of Microsoft AI, Suleyman oversees efforts to integrate the same AI that powers ChatGPT into software—including the Windows operating system—that runs most of the world is personal computers.\nIn its latest upgrade, Microsoft announced today that its AI assistant, Copilot, now has a humanlike voice, the ability to see a user is screen, and better reasoning skills.\nSuleyman says it is all part of a plan to make users fall back in love with the PC. He spoke to WIRED senior writer Will Knight from Redmond, Washington—over Microsoft Teams, naturally. The conversation has been lightly edited.\nWill Knight: What is the new vision for Copilot?\nMustafa Suleyman: We really are at this amazing kind of transition point. AI companions now see what we see, hear what we hear, and speak in the same language that we use to communicate with one another.\nThere is this new sort of design material that is actually about persistence, about relationship, about emotion. And I am sort of crafting experiences which are about a kind of lasting, sustained interaction with a companion.\nYou joined Microsoft from Inflection AI, where the focus was building supportive and empathetic AI. It sounds like you have brought that to your new employer.\nWhat I have long believed in, even since before DeepMind days, is AI is potential to provide support. Emotional support is actually one of the things I first worked on as a 19-year-old, when I started a telephone counseling service.\nThat is the beauty of this technological moment. To see what it feels like to engage with one of these experiences over a sustained period of time—this companion that really gets to know you. It is coaching you, encouraging you, supporting you, teaching you. I think that is not going to feel like a computer anymore.\nWhat is the idea with Copilot Vision, the labs feature that Pro users will be able to try?\nThe vision mode enables you to say what is that thing over there [on your screen]? Or, Wait, what is that? What do you think of that? Is that cool?\nThere is just so many little moments when you are sitting at your computer. It is phenomenal to have this AI companion see whatever you see, and talk to you in real time about what you are looking at. It sort of changes the route that you take through your digital life, because you do not have the burden of having to type something in.\nThis sounds like Recall, the controversial and now opt-in Windows feature that records a users' on screen.\nWe do not save any of the material with Copilot Vision, so once you close the browser after your session, it all just disappears. It fully deletes. But I am thinking about if and how to introduce it in the future, because a lot of people do want that experience. If you could just say, ‘What was that picture that I saw online the other day? What was that meme?' I think we will have to look into it one day.\nAt the moment, though, the Copilot Vision tool is ephemeral. We will sort of have to experiment over time and see what makes sense on that front.\nWhat about the privacy risks introduced when people share sensitive information with Copilot otherwise?\nWe store the logs that you generate as a result of your conversation, those in the most secure way, to the highest standard of Microsoft Security. And we do save those because obviously you do want conversation history.\nYou are also introducing Think Deeper, which will let Copilot tackle more difficult problems. This is based on OpenAI is o1 model, aka Strawberry, right?\nIt is like Strawberry, yeah. There is an OpenAI model that we have tuned up for our more consumer purposes, and we have got it to act in a way that is more consistent with our AI companion theme.\nWhat are the differences?\nOpenAI is is much more focused on pure math and scientific problem-solving. And what we have tried to do is have it focus on side-by-side comparisons and sort of consumer analysis, stuff like that.\nOr when you get stuck on a hard problem or you want to reason through something, then it can really lay out a side-by-side comparison, or do an analysis at scale.\nAre people at Microsoft already using this new version of Copilot?\nYeah, everyone is using it. We have just gone on general availability across the company a few days ago. So everybody is using it, giving tons and tons of feedback. Our feedback channels are absolutely slammed. It is a lot of fun.\nPeople are going to remember Clippy, Microsoft is last AI helper for Windows. Do people there see parallels?\nHa, well I saw Bill Gates the other day, and he was like, you do realize you have misnamed this whole AI thing? It should be called Clippy. I was like, dude!\nBut I mean, it just shows you how mind-blowing people like Bill are. People who see, not just, you know, two years ahead, but 20 years.\nAre the new features a step toward so-called AI agents, which do useful chores on a computer?\nYeah, absolutely. The first stage is AI processing the same information that you process—seeing what you see, hearing what you hear, consuming the text that you consume. The second phase is [AI having] a long term, persistent memory that creates a shared understanding over time. And the third stage is AI interacting with third parties by sending instructions and taking actions—to buy things, book things, plan a schedule. And we have got these two features in an experimental R&D mode that we are working on.\nWait, you have an AI agent for Windows that can go off and buy things for you?\nIt is a way off, but yes, we have closed the loop, we have done transactions. The problem with this technology is that you can get it working 50, 60 percent of the time, but getting it to 90 percent reliability is a lot of effort. I have seen some stunning demos where it can independently go off and make a purchase, so on. But I have also seen some car crash moments where it does not know what it is doing.\nTell me more about a car crash. Did it go off and buy a Lamborghini on Bill is credit card?\nIf it used Bill is credit card, then I think it would be quite funny. But no, like I said, we are still figuring it out step by step. It is still deep in the doldrums of the labs. There is a long way to go with these things but you can count it in quarters, not years, I would say.\nWhat is going to be the biggest challenge for you in making the kind of AI future you are describing into reality?\nThe big thing here is figuring out how to craft technology that is trusted, because it is going to feel like a very intimate and personal experience. We have got to get the security part right, we have got to get the privacy part right, of course. But I think the real thing is trying to design the conversation so that the agent is able to articulate boundaries, so it can say that is not something I am prepared to engage in.\nIf we can nail that, that is the foundation of a trusted experience, and then I think we can really push into the complicated side of things, which is how do we let it buy things for you on your behalf, or negotiate on your behalf, or enter into a contract on your behalf, or plan a schedule for you that involves three or four different stops over the course of a Saturday afternoon. And you are like, I trust you, Copilot, you got this, right? That is really what we are working toward."
    },
    {
        "title": "Microsoft gives Copilot a voice and vision in its biggest redesign yet",
        "description": "Microsoft is overhauling its Copilot AI assistant with a new design and features. Copilot is getting voice and vision features that offer more personalized feeds.",
        "url": "https://www.theverge.com/2024/10/1/24259187/microsoft-copilot-redesign-vision-voice-features-inflection-ai",
        "publishedAt": "2024-10-01T14:00:00Z",
        "content": " Microsoft is unveiling a big overhaul of its Copilot experience today, adding voice and vision capabilities to transform it into a more personalized AI assistant. As I exclusively revealed in my Notepad newsletter last week, Copilot is new capabilities include a virtual news presenter mode to read you the headlines, the ability for Copilot to see what you are looking at, and a voice feature that lets you talk to Copilot in a natural way, much like OpenAI is Advanced Voice Mode.\n\nCopilot is being redesigned across mobile, web, and the dedicated Windows app into a user experience that is more card-based and looks very similar to the work Inflection AI has done with its Pi personalized AI assistant. Microsoft hired a bunch of folks from Inflection AI earlier this year, including Google DeepMind cofounder Mustafa Suleyman, who is now CEO of Microsoft AI. This is Suleyman is first big change to Copilot since taking over the consumer side of the AI assistant.\n\nAt Microsoft AI, we are creating an AI companion for everyone, says Suleyman in an open letter today. I truly believe we can create a calmer, more helpful and supportive era of technology, quite unlike anything we have seen before.\n\n[Image: The redesigned Copilot experience on the web. \n\nCopilot now looks unlike anything I have seen from Microsoft before, with an interface that is a big departure from what exists right now. It is a lot warmer, with a personalized Copilot Discover page that is more useful and inviting than a text entry prompt for a chatbot. Microsoft is customizing this entire Copilot homepage based on your conversation history, and over time, it will include useful searches, tips, and relevant information.\n\nMicrosoft split off its consumer version of Copilot to Suleyman is team earlier this year, and it is clearly allowed the company to experiment more with personality and customization. What we have learned from the Pi team and the [Inflection AI] folks that came over is that they have always had an attention to detail on the needs of customers, says Yusuf Mehdi, executive vice president and consumer chief marketing officer at Microsoft, in an interview with The Verge. The way they listen and what they have learned from these long conversations in that research has certainly influenced what we have done here.\n\n[Image: The new Copilot experience on mobile. \n\nBeyond the look and feel of this new Copilot, Microsoft is also ramping up its work on its vision of an AI companion for everyone by adding voice capabilities that are very similar to what OpenAI has introduced in ChatGPT. You can now chat with the AI assistant, ask it questions, and interrupt it like you would during a conversation with a friend or colleague. Copilot now has four voice options to pick from, and you are encouraged to pick one when you first use this updated Copilot experience.\n\nWe are making a huge bet on voice, says Mehdi. When you use it with the way we have designed it, you really start to let yourself go and have conversations. Then you see the glimmers of where we are going to go long term, with vision where the AI can actually help you and see what you see if you want it to.\n\nCopilot Vision is Microsoft is second big bet with this redesign, allowing the AI assistant to see what you see on a webpage you are viewing. You can ask it questions about the text, images, and content you are viewing, and combined with the new Copilot Voice features, it will respond in a natural way. You could use this feature while you are shopping on the web to find product recommendations, allowing Copilot to help you find different options.\n\n[Media: \n\nCopilot Vision sessions are opt-in and ephemeral, and Microsoft says none of the content Copilot Vision engages with is stored or used for training. This new experience will not work on all websites yet because Microsoft has put restrictions on the types of websites Copilot Vision works with. We are starting with a limited list of popular websites to help ensure it is a safe experience for everyone, says the Copilot team. During preview, Copilot Vision will not work on paywalled and sensitive content, either.\n\nDespite the disclaimers, Microsoft clearly has a long-term vision for these new voice and vision features in Copilot. One demo shows Copilot Vision being used to look at photos of old handwritten recipes, helping to explain what the food is and offering tips on how long it takes to make the recipe. Microsoft demonstrated a similar assistive experience for Xbox games earlier this year, showing how Copilot could help you navigate through Minecraft.\n\nThis next phase of Copilot also includes Copilot Daily, an audio summary of news and weather that Copilot reads out as if it were a CNN anchor. It is designed as a short clip you can listen to in the mornings, and it only uses content from news and weather providers that have authorized Copilot to use their content. Microsoft is working with Reuters, Axel Springer, Hearst, and the Financial Times initially, with plans to add more sources over time.\n\n[Video: Copilot Daily]\n\nCopilot can also handle more complex questions thanks to OpenAI is latest models. Think Deeper is a new feature in Copilot that lets the assistant take more time to respond, allowing it to supply step-by-step answers to complex questions. It is designed to work best when you are trying to compare two options side by side, like, for example, Should I move to New York or San Francisco? \n\nThink Deeper is still early in development, and Microsoft is placing it into Copilot Labs, a new way to test out experimental features that the company is still developing. Copilot Vision will also be part of the Labs feature initially, and participants will be able to provide feedback on the experiences. Microsoft is clearly treading carefully with Copilot Vision after the backlash around its initial Recall security and privacy issues. Microsoft revealed last week that Recall has been overhauled with improved security and privacy options, and you will even be able to fully uninstall the feature or not turn it on in the first place.\n\nThis updated Copilot experience will be available today in the mobile iOS and Android apps, on the web at copilot.microsoft.com, and through the Copilot Windows app. Copilot Voice will be initially available in English in Australia, Canada, New Zealand, the UK, and the US, before expanding to more regions and languages in the future. Copilot Daily is limited to the US and the UK before it expands elsewhere, and Copilot Vision will be limited to a number of Copilot Pro subscribers in the US.\n\nIf, like me, you are wondering where Copilot heads next, Microsoft is new AI CEO has some grand ideas. Over time it will adapt to your mannerisms and develop capabilities built around your preferences and needs. We are not creating a static tool so much as establishing a dynamic, emergent, and evolving interaction, says Suleyman. It will accompany you to that doctor is appointment, taking notes and following up at the right time. It will share the load of planning and preparing for your child is birthday party. And it will be there at the end of the day to help you think through a tricky life decision.\n By  Tom Warren, a senior editor and author of Notepad, who has been covering all things Microsoft, PC, and tech for over 20 years. Sign up for Notepad by Tom Warren, a weekly newsletter uncovering the secrets and strategy behind Microsoft is era-defining bets on AI, gaming, and computing. Subscribe to get the latest straight to your inbox."
    },
    {
        "title": "Microsoft wants to know why some game developers aren’t on Xbox",
        "description": "Microsoft is looking for Xbox feedback from game developers. The Xbox Research team wants to know about all the pain points in bringing games to Xbox.",
        "url": "https://www.theverge.com/2024/10/2/24260296/microsoft-xbox-research-developers-outreach",
        "publishedAt": "2024-10-02T15:13:46Z",
        "content": " Microsoft wants to hear from game developers who might be skipping Xbox or those already building games using the company is developer tools. The software maker is expanding its Xbox Research team to include the community of game developers, seeking feedback directly from developers about tools, support, and the overall pain points of the Xbox platform.\n\nA new program, much like Microsoft is Xbox Insider one, is now open to all members of game studios, not just technical employees. Typically, it takes a lot of people to make and ship a game, including marketing, user research, artists, audio, PMs, community managers, and more, says Deborah Hendersen, PhD, principal user researcher for Xbox. We want to hear from everyone who works on games or helps support game studios because if we can make your life easier, it makes gaming better.\n\nWhile the program will gather feedback about tools, performance tuning, debugging utilities, and plenty of other aspects of game development, it is also designed for input from game studios that are not shipping games on Xbox. If you are not on Xbox, we would love to know why, says Hendersen. And honestly, if you are using our competitor is products, you probably have a great perspective we could learn from!\n\nMicrosoft is outreach for direct game developer feedback comes amid some noticeable delays for third-party releases on Xbox. Baldur is Gate 3 launched on Xbox several months after it first debuted on PS5, because of technical issues developing for the Xbox Series S. Capcom revealed last month that its two new fighting game collections — Marvel vs. Capcom Fighting Collection: Arcade Classics and Capcom Fighting Collection 2 — will come to Xbox in 2025 after technical discussions with Microsoft.\n\nBlack Myth: Wukong is also coming to Xbox after its PS5 release, as its developers are currently optimizing the Xbox Series X|S version to meet our quality standards. Microsoft says the delay is not due to Xbox platform limitations that have been raised to us, and single-sourced reports suggest there could be some kind of Sony exclusivity deal involved.\n\nThe developers of Enotria: The Last Song also publicly announced an indefinite delay to the Xbox version of the game last month, after struggling with Microsoft is game review process. The studio is statement about the issues caught the attention of Xbox chief Phil Spencer, who reached out to the team to help resolve the situation.\n\nMicrosoft would obviously prefer to receive this type of feedback from game developers privately, to avoid potential headlines about game developers skipping the platform due to technical issues, tooling, or even processes. Hopefully, this expansion of Xbox Research will help address the pain points that prevent some game developers from releasing Xbox games.\n By  Tom Warren, a senior editor and author of Notepad, who has been covering all things Microsoft, PC, and tech for over 20 years. Sign up for Notepad by Tom Warren, a weekly newsletter uncovering the secrets and strategy behind Microsoft is era-defining bets on AI, gaming, and computing. Subscribe to get the latest straight to your inbox."
    },
    {
        "title": "You can sign up to test Microsoft Flight Simulator 2024 if your PC is up to it",
        "description": "Microsoft is holding an alpha test for Flight Simulator 2024. It’s designed to stress test the core services of the game, ahead of its debut on November 19th.",
        "url": "https://www.theverge.com/2024/10/9/24265946/microsoft-flight-simulator-2024-alpha-test",
        "publishedAt": "2024-10-09T11:31:03Z",
        "content": " Microsoft is holding a technical alpha later this month for the upcoming Microsoft Flight Simulator 2024 release. The technical alpha will be held over an unspecified weekend in October to test the game is core services ahead of its debut on November 19th. Participants in the test phase will need a capable PC gaming rig to try out Microsoft Flight Simulator 2024 before its release, as this alpha test will not be available to Xbox players.\n\nFree flight and a limited amount of career, challenges, and discovery will be accessible during the technical alpha, alongside a limited number of aircraft. The technical alpha has been designed to gather feedback on specific areas and features, and the scope of what is available is limited, says the Microsoft Flight Simulator team. You can sign up for the alpha test here. \n\nThe current version of Microsoft Flight Simulator is already a demanding game on PC, and this 2024 edition looks set to raise the PC requirements even further. The recommended specs include 32GB of RAM, an Intel Core i7-10700K, and an RTX 2080. Ideally though, Microsoft says you will want up to 64GB of RAM, an RTX 4080, and an Intel Core i7-14700K if you want to play at max settings.\n\nOnce Microsoft Flight Simulator 2024 releases next month, you will be able to fly an air ambulance, be part of a mountain rescue team, or act as search and rescue. There is even VIP charter services, skydive aviation, air racing, and hot air balloon trips.\n\nMicrosoft Flight Simulator 2024 is also getting smaller, with the install size reduced to around 30GB. Microsoft is using its latest cloud streaming technology to stream high detailed areas on a flight path, reducing the amount that needs to be preinstalled. Testing this cloud streaming technology is a big part of the Microsoft Flight Simulator 2024 technical alpha later this month.\n\nMicrosoft Flight Simulator 2024 debuts on PC and Xbox Series S / X on November 19th.\n By  Tom Warren, a senior editor and author of Notepad, who has been covering all things Microsoft, PC, and tech for over 20 years. Sign up for Notepad by Tom Warren, a weekly newsletter uncovering the secrets and strategy behind Microsoft is era-defining bets on AI, gaming, and computing. Subscribe to get the latest straight to your inbox."
    },
    {
        "title": "Microsoft’s Copilot key will be able to launch apps on Windows 11 soon",
        "description": "Microsoft is testing a new Copilot key customization feature for Windows 11. It will allow you to launch apps with the Copilot key.",
        "url": "https://www.theverge.com/2024/9/20/24250067/microsoft-windows-11-copilot-key-customization-apps",
        "publishedAt": "2024-09-20T17:45:55Z",
        "content": " Microsoft is planning to allow Windows 11 users to customize the Copilot key that has started shipping on new laptops and keyboards. The Copilot key is configured as default to launch Microsoft is Copilot app on Windows 11, but the company is now testing the ability to use it to launch other apps instead.\n\nA new beta build of Windows 11 includes the customization changes, available for testers today. You can choose to have the Copilot key launch an app that is MSIX packaged and signed, thus indicating the app meets security and privacy requirements to keep customers safe, explains the Windows Insider team in a blog post. The key will continue to launch Copilot on devices that have the Copilot app installed until a customer selects a different experience.\n\n[Image: The Copilot key customization in Windows 11. \n\nThe Copilot key is the first big change to Windows keyboards in 30 years and part of a push by Microsoft to encourage Windows users to try its AI assistant. \n\nNew Copilot Plus PCs also started shipping with the key earlier this year, with Microsoft actually making the Copilot experience less useful on these new devices by turning Copilot into a web app in the latest 24H2 update to Windows 11.\n\nThis web app version of Copilot no longer integrates into the Windows 11 settings, so you can not use the AI assistant to control whether you have dark mode enabled or a variety of other settings. It is still not clear how Microsoft intends to evolve the Copilot experience in Windows, nor whether the company will turn its Copilot key into something that could be used more like the Windows key to launch shortcuts.\n\nGiven the customization for the Copilot key is available to beta testers of Windows 11 today, I would expect we will see this available for all Windows 11 users in the coming months.\n By  Tom Warren, a senior editor and author of Notepad, who has been covering all things Microsoft, PC, and tech for over 20 years. Sign up for Notepad by Tom Warren, a weekly newsletter uncovering the secrets and strategy behind Microsoft is era-defining bets on AI, gaming, and computing. Subscribe to get the latest straight to your inbox."
    },
    {
        "title": "Microsoft Deal Will Bring Nuclear Power Back to Three Mile Island",
        "description": "As AI ramps up carbon emissions, Microsoft is going nuclear.",
        "url": "https://gizmodo.com/microsoft-deal-will-bring-nuclear-power-back-to-three-mile-island-2000501273",
        "publishedAt": "2024-09-20T14:25:56Z",
        "content": " A nuclear power plant at Pennsylvania is Three Mile Island will be recommissioned thanks to a power purchase deal with Microsoft aimed at offsetting the tech giant is carbon emissions. Microsoft is environmental impact has come under particular criticism in recent days. Earlier this week, The Guardian reported that it and several other tech giants were severely underestimating the carbon emissions caused by their data centers. According to the paper, Microsoft is data centers were responsible for between 280,782 metric tons and 6.1 million metric tons of CO2 equivalent emissions in 2022, depending on the accounting method used. Last week, The Atlantic reported that despite Microsoft is publicly stated goal of becoming carbon-negative and promises that its AI is helping to avert environmental crises, the company has been furnishing some of the world is largest fossil fuel companies with AI tools designed to help locate new reserves of oil and gas. This agreement is a major milestone in Microsoft is efforts to help decarbonize the grid in support of our commitment to become carbon negative, Bobby Hollis, vice president of energy at Microsoft, said in a statement included in Constellation is announcement. Microsoft continues to collaborate with energy providers to develop carbon-free energy sources to help meet the grids' capacity and reliability needs. Before it was shut down for economic reasons in 2019, the Three Mile Island Reactor, which will be renamed Crane Clean Energy Center, had a generating capacity of 837 megawatts, enough to power 800,00 homes, Constellation said. The reactor is expected to go back online in 2028 and Microsoft has agreed to a 20-year power purchase agreement. \nConstellation EnergyData centerMicrosoftnuclearThree Mile Island  \n  A new scheme for AI fuel could offload financial risk from Microsoft is business partner onto the American taxpayer.\n  \n  Microsoft said it is calling it quits on HoloLens 2 production. By 2028, the company will stop offering any more updates for its VR headsets.\n  "
    },
    {
        "title": "Install Microsoft Word, Excel, and PowerPoint by Paying $25 One Time and Supercharge Your Productivity, 89% Off Now!",
        "description": "Save 89% on a lifetime license for Microsoft Office Professional Plus 2019.",
        "url": "https://gizmodo.com/install-microsoft-word-excel-and-powerpoint-by-paying-25-one-time-and-supercharge-your-productivity-89-off-now-2000500426",
        "publishedAt": "2024-09-18T20:51:26Z",
        "content": " This license for Microsoft Office Professional Plus is just $25 and that is huge. So many software developers have upended their business models. We used to be able to just buy a license for X amount of cash and then cool, you had that software forever. The tech industry has wised-up and realized they can make a butt load more money if they consistently charge us for their product. Now you can not just buy Photoshop one, you have got to subscribe to the Adobe Creative Suite and pay for additional apps you do not need while continuing to pay over and over every month or year. Software-as-a-Service sucks. Microsoft is no exception. Microsoft 365 is now the main way the company promotes its Office apps like Word, Excel, and PowerPoint. However, you can still sneak your own copy of these mandatory programs the old fashioned way. StackSocial has Microsoft Office Professional Plus 2019 for just $25. Not only is that 89% less than what the website lists it for by default. The real discount is that it is a one time payment. No recurring fees that will suddenly go up in price. You just pay the 25 bucks and then you will have access to the full suite of Microsoft Office. Now there are some caveats. This is for Office 2019. Not the most up to date versions of this software, but what that also means is it does not have any useless AI garbage tacked into it. Word, PowerPoint, and Excel have basically been the same thing since their inception. So what are you really missing out on? Not much. This version of the Microsoft Office suite supports all languages and requires your system to run Windows 10 or higher for PCS or Monterey, Ventura, or Sonoma for Macs. Save 89% now on StackSocial. Microsoft Office Professional Plus 2019 for both Windows and Mac is going for just $25 for a lifetime license."
    },
    {
        "title": "Microsoft starts rolling out its Windows 11 2024 update with lots of useful improvements",
        "description": "Microsoft’s latest Windows 11 2024 update is now rolling out. It includes improvements to the Start menu, File Explorer, system tray, and Settings.",
        "url": "https://www.theverge.com/2024/10/1/24258260/microsoft-windows-11-2024-update-24h2-download",
        "publishedAt": "2024-10-01T14:00:00Z",
        "content": " Microsoft is starting to release its Windows 11 2024 update today, also known as version 24H2. This update includes a number of small but useful additions to Windows 11 that improve the Start menu, File Explorer, Settings, and much more.\n\nThe Start menu has a big change for those using Microsoft is Phone Link software. The Windows 11 2024 update adds a side panel to the Start menu that provides information on your phone is battery status and notifications as well as quick access to messages, calls, and photos. The floating panel is a neat addition for Phone Link users.\n\nIf you own an HDR monitor, this latest Windows 11 update will enable HDR background support, and you can also now easily toggle monitor color profiles directly within the Settings page. \n\n[Image: File Explorer now has labels on copy, paste, and more. \n\nFile Explorer is also getting some useful changes in the Windows 11 2024 update. The home section has been redesigned slightly to combine recent, favorites, and shared files into a tabbed view. The context menus within File Explorer and across Windows 11 have also been updated, so common actions like copy, paste, and rename now have labels and are larger and clearer to use. You can now create 7z and TAR files, too. \n\nIn the system tray, Microsoft has switched up the time and date UI so it is more simplified and the year is no longer listed. Quick Settings has also been overhauled to include all of the quick actions by default, and you can now drag and drop them freely. Microsoft has also reworked the power options in Windows 11 with a new Energy Saver mode that is designed to save battery life on laptops. You can also change what happens when you press the power button or lift a laptop lid and set power profiles easily within Settings.\n\n[Image: You can now easily reverse the mouse scroll wheel direction. \n\nOther improvements to the Settings interface include the ability to finally reverse the mouse scroll direction without having to use the Windows registry. Microsoft has also added the ability to toggle enhanced pointer precision for a mouse in the Settings interface, instead of having to delve into the legacy Control Panel. \n\nSudo is part of this Windows 11 2024 update, allowing developers to use the popular command from Unix-based operating systems. It is useful for developers who want to test scripts, and Microsoft is using sudo inside of Windows to let developers run elevated tools directly from an unelevated console session.\n\nOther changes in this Windows 11 update include a unified version of the Microsoft Teams app that works for both professional and personal accounts. Microsoft has also replaced the Mail and Calendar apps with a new Outlook client, and the Copilot app has turned into a web app that no longer directly interacts with Windows 11 settings.\n\n[Image: The new unified Microsoft Teams app. \n\nThe Windows 11 2024 update also includes support for Wi-Fi 7 and Bluetooth LE audio and improves performance for the latest AMD desktop CPUs. \n\nMicrosoft is slowly rolling out 24H2 to existing devices. We are taking a phased approach with the 2024 Update rollout, based on when data shows your device is ready and you will have a great experience, explains John Cable, vice president of program management for Windows servicing and delivery. The first phase will start over the coming weeks. We will begin with eligible devices running Windows 11, version 22H2 and 23H22 for those who have previously opted in to be amongst the first to experience new enhancements.\n\nMicrosoft is using the OS swap method for 24H2, where it replaces the entire OS with an updated version, instead of what it has done in the past with the 23H2 update, which was a service update to the existing OS. This means Microsoft will only offer you 24H2 once your device is fully compatible and ready to upgrade. There could be application or device driver incompatibilities that Microsoft detects and places a safeguard against upgrading your device.\n By  Tom Warren, a senior editor and author of Notepad, who has been covering all things Microsoft, PC, and tech for over 20 years. Sign up for Notepad by Tom Warren, a weekly newsletter uncovering the secrets and strategy behind Microsoft is era-defining bets on AI, gaming, and computing. Subscribe to get the latest straight to your inbox."
    },
    {
        "title": "Microsoft Paint is getting Photoshop-like generative AI fill and erase features",
        "description": "Microsoft’s Copilot Plus PCs are getting some new AI-powered editing features for Paint and Photos that could make creatives less reliant on more professional software.",
        "url": "https://www.theverge.com/2024/10/1/24259239/microsoft-paint-generative-erase-fill-photos-upscaling",
        "publishedAt": "2024-10-01T14:00:00Z",
        "content": " Microsoft is bringing some new AI-powered Paint and Photos features to Copilot Plus PCs that could make creatives less reliant on more powerful image editing software. Generative Fill and Generative Erase — which appear to be heavily inspired by similar AI tools in Adobe Photoshop — are being introduced to Paint, allowing users to precisely add or remove objects in their images.\n\nBoth tools utilize a size-adjustable brush to paint over specific areas of an image to edit. Generative Erase will remove unwanted figures, objects like background clutter, and other distractions, similar to the Magic Eraser feature on Google is Pixel phones. Generative Fill allows Paint users to add new AI-generated assets to an image using a text description and select precisely where they should be placed — much like the Photoshop tool that shares the same name.\n\nThese build on the Cocreator tool for Paint announced for Copilot Plus PCs earlier this year that can generate images using a combination of text prompts and reference sketches. The company says the diffusion-based model powering these features has been updated to improve output quality and speed and now includes built-in moderation to help prevent it from being abused.\n\n[Image: The new upscaling capabilities in Photos is pretty impressive, if the pixel dimensions shown in this example image are accurate. \n\nMicrosoft is Photos app is also getting the Generative Erase tool, alongside a new Super-Resolution feature that uses on-device AI to upscale blurry or pixelated images. Users can upscale images by up to eight times their original resolution and adjust the level of upscaling with a slider, matching the capabilities of tools like Canva is image upscaler and exceeding Adobe Lightroom is 4x Super Resolution enhancement. It is available for free and is speedy enough to upscale images up to 4K within seconds, according to Microsoft.\n"
    }
]